<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>deyituo - Gogogo</title>
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://deyituo.github.io/"/>
  <updated>2016-06-09T05:51:41.000Z</updated>
  <id>http://deyituo.github.io/</id>
  
  <author>
    <name>Deyi Tuo</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>人脸检测算法概述</title>
    <link href="http://deyituo.github.io/2016/06/07/%E4%BA%BA%E8%84%B8%E6%A3%80%E6%B5%8B%E7%AE%97%E6%B3%95%E6%A6%82%E8%BF%B0/"/>
    <id>http://deyituo.github.io/2016/06/07/人脸检测算法概述/</id>
    <published>2016-06-07T12:31:29.000Z</published>
    <updated>2016-06-09T05:51:41.000Z</updated>
    
    <content type="html">&lt;p&gt;&amp;#x81EA; 2001 &amp;#x5E74; Viola &amp;#x548C; Jones &lt;a href=&quot;#1&quot;&gt;[1]&lt;/a&gt; &amp;#x5C06;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;&amp;#x5F15;&amp;#x5165;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x9886;&amp;#x57DF;&amp;#xFF0C; &amp;#x5176;&amp;#x540E;&amp;#x53D1;&amp;#x5C55;&amp;#x8D77;&amp;#x6765;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x88AB;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6210;&amp;#x66F4;&amp;#x597D;&amp;#x5730;&amp;#x5904;&amp;#x7406;&amp;#x591A;&amp;#x89D2;&amp;#x5EA6;&amp;#x68C0;&amp;#x6D4B;&amp;#xFF0C; &amp;#x906E;&amp;#x6321;&amp;#xFF0C; &amp;#x6A21;&amp;#x7CCA;&amp;#x7B49;&amp;#x95EE;&amp;#x9898; &lt;a href=&quot;#15&quot;&gt;[15]&lt;/a&gt;&lt;a href=&quot;#16&quot;&gt;[16]&lt;/a&gt;&amp;#x3002; &amp;#x8FD9;&amp;#x4E9B;&amp;#x7B97;&amp;#x6CD5;&amp;#x4E3B;&amp;#x8981;&amp;#x6709;&amp;#x4E09;&amp;#x5927;&amp;#x7C7B;&amp;#x5206;&amp;#x652F;&amp;#xFF0C; &amp;#x7B2C;&amp;#x4E00;&amp;#x7C7B;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x53CA;&amp;#x5176;&amp;#x6539;&amp;#x8FDB;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x5982;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#6&quot;&gt;[6]&lt;/a&gt;&lt;a href=&quot;#17&quot;&gt;[17]&lt;/a&gt;&lt;a href=&quot;#18&quot;&gt;[18]&lt;/a&gt; &amp;#x4E2D;&amp;#x6240;&amp;#x63D0;&amp;#x5230;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x65B9;&amp;#x6CD5;&amp;#x5728;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#xFF0C; &amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x6784;&amp;#x9020;&amp;#xFF0C; &amp;#x8FD0;&amp;#x884C;&amp;#x901F;&amp;#x7387;&amp;#xFF0C; &amp;#x591A;&amp;#x89D2;&amp;#x5EA6;&amp;#x6A21;&amp;#x677F;&amp;#x5747;&amp;#x8FDB;&amp;#x884C;&amp;#x4E86;&amp;#x5927;&amp;#x91CF;&amp;#x7684;&amp;#x6539;&amp;#x8FDB;&amp;#x3002;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x4F7F;&amp;#x5F97;&amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#x975E;&amp;#x4EBA;&amp;#x8138;&amp;#x533A;&amp;#x57DF;&amp;#x53EF;&amp;#x4EE5;&amp;#x5FEB;&amp;#x901F;&amp;#x6392;&amp;#x9664;&amp;#xFF0C; &amp;#x4ECE;&amp;#x800C;&amp;#x83B7;&amp;#x5F97;&amp;#x4E86;&amp;#x9AD8;&amp;#x6548;&amp;#x7684;&amp;#x8FD0;&amp;#x884C;&amp;#x901F;&amp;#x7387;&amp;#x3002; &amp;#x8FD9;&amp;#x7C7B;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7CFB;&amp;#x7EDF;&amp;#x5DF2;&amp;#x7ECF;&amp;#x88AB;&amp;#x5E7F;&amp;#x6CDB;&amp;#x5730;&amp;#x8FD0;&amp;#x7528;&amp;#x4E8E;&amp;#x94F6;&amp;#x884C;&amp;#xFF0C; &amp;#x6444;&amp;#x50CF;&amp;#x5934;&amp;#x76D1;&amp;#x63A7;&amp;#x7CFB;&amp;#x7EDF;&amp;#xFF0C; &amp;#x79FB;&amp;#x52A8;&amp;#x624B;&amp;#x673A;&amp;#xFF0C; &amp;#x7F51;&amp;#x7EDC;&amp;#x793E;&amp;#x533A;&amp;#x7B49;&amp;#x3002;&amp;#x7B2C;&amp;#x4E8C;&amp;#x7C7B;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B; (DPM) &lt;a href=&quot;#8&quot;&gt;[8]&lt;/a&gt; &amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x8FD9;&amp;#x7C7B;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x6A21;&amp;#x578B;&amp;#x5305;&amp;#x542B;&amp;#x82E5;&amp;#x5E72;&amp;#x7EC4;&amp;#x6210;&amp;#x90E8;&amp;#x5206;&amp;#xFF0C; &amp;#x800C;&amp;#x8FD9;&amp;#x4E9B;&amp;#x7EC4;&amp;#x6210;&amp;#x90E8;&amp;#x5206;&amp;#x901A;&amp;#x8FC7;&amp;#x4F4D;&amp;#x7F6E;&amp;#x5173;&amp;#x7CFB;&amp;#x8FDB;&amp;#x884C;&amp;#x7EA6;&amp;#x675F;&amp;#x5F97;&amp;#x5230;&amp;#x6574;&amp;#x4F53;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x6A21;&amp;#x578B;&amp;#xFF0C; &amp;#x8FD9;&amp;#x7C7B;&amp;#x6A21;&amp;#x578B;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x5F62;&amp;#x53D8;&amp;#x53CA;&amp;#x906E;&amp;#x6321;&amp;#x5177;&amp;#x6709;&amp;#x5F88;&amp;#x597D;&amp;#x7684;&amp;#x9002;&amp;#x5E94;&amp;#x6027;&amp;#x548C;&amp;#x5F88;&amp;#x9AD8;&amp;#x7684;&amp;#x7075;&amp;#x6D3B;&amp;#x6027;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt;&amp;#x5728;&amp;#x5F97;&amp;#x5230;&amp;#x7EC4;&amp;#x6210;&amp;#x90E8;&amp;#x5206;&amp;#x7684;&amp;#x540C;&amp;#x65F6;&amp;#x8FDB;&amp;#x884C;&amp;#x4E86;&amp;#x4EBA;&amp;#x8138;&amp;#x6807;&amp;#x5B9A;&amp;#x70B9;&amp;#xFF0C; &amp;#x4EBA;&amp;#x8138;&amp;#x89D2;&amp;#x5EA6;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x3002; &amp;#x7B2C;&amp;#x4E09;&amp;#x7C7B;&amp;#x662F;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E3B;&amp;#x8981;&amp;#x7531;&amp;#x82E5;&amp;#x5E72;&amp;#x5C42;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#xFF0C; Pooling &amp;#x5C42;&amp;#xFF0C; &amp;#x5168;&amp;#x8FDE;&amp;#x63A5;&amp;#x5C42;&amp;#x7EC4;&amp;#x6210;&amp;#xFF0C; &amp;#x5BF9;&amp;#x56FE;&amp;#x50CF;&amp;#x63D0;&amp;#x53D6;&amp;#x7684;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7279;&amp;#x5F81;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x6709;&amp;#x66F4;&amp;#x9AD8;&amp;#x5C42;&amp;#x6B21;&amp;#x7684;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#19&quot;&gt;[19]&lt;/a&gt; &amp;#x901A;&amp;#x8FC7;&amp;#x8BAD;&amp;#x7EC3;&amp;#x591A;&amp;#x4E2A;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x6A21;&amp;#x578B;&amp;#x6765;&amp;#x63D0;&amp;#x9AD8;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x6548;&amp;#x679C;&amp;#x3002; &amp;#x7531;&amp;#x4E8E;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x4F18;&amp;#x95EE;&amp;#x9898; &lt;a href=&quot;#20&quot;&gt;[20]&lt;/a&gt; &amp;#x53CA;&amp;#x8BAD;&amp;#x7EC3;&amp;#x56F0;&amp;#x96BE;&amp;#xFF0C; &amp;#x8FC7;&amp;#x53BB;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x66F4;&amp;#x591A;&amp;#x5730;&amp;#x8FDB;&amp;#x884C;&amp;#x524D;&amp;#x4E24;&amp;#x7C7B;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x7814;&amp;#x7A76;&amp;#x3002; &amp;#x968F;&amp;#x7740;&amp;#x8FD1;&amp;#x5E74;&amp;#x6765;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x6210;&amp;#x529F;&amp;#xFF0C; &amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7B97;&amp;#x6CD5;&amp;#x91CD;&amp;#x65B0;&amp;#x88AB;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x6240;&amp;#x91CD;&amp;#x89C6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x672C;&amp;#x6587;&amp;#x9996;&amp;#x5148;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x548C;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x4EE5;&amp;#x53CA;&amp;#x5F53;&amp;#x524D;&amp;#x7814;&amp;#x7A76;&amp;#x4E2D;&amp;#x5BF9;&amp;#x8FD9;&amp;#x4E9B;&amp;#x7B97;&amp;#x6CD5;&amp;#x8FDB;&amp;#x884C;&amp;#x7684;&amp;#x6539;&amp;#x8FDB;&amp;#x3002; &amp;#x63A5;&amp;#x7740;&amp;#xFF0C; &amp;#x7B80;&amp;#x5355;&amp;#x9610;&amp;#x8FF0;&amp;#x4E86;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x53CA;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x5386;&amp;#x53F2;&amp;#xFF0C; &amp;#x7136;&amp;#x540E;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x4EE5;&amp;#x53CA;&amp;#x8FD1;&amp;#x6765;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#x3002; &amp;#x6700;&amp;#x540E;&amp;#xFF0C;&amp;#x672C;&amp;#x6587;&amp;#x5C0F;&amp;#x7ED3;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E09;&amp;#x7C7B;&amp;#x65B9;&amp;#x6CD5;&amp;#x7684;&amp;#x5F02;&amp;#x540C;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;a href=&quot;#&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;/a&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&lt;/h2&gt;&lt;p&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6269;&amp;#x5C55;&amp;#x4E86; Viola &amp;#x548C; Jones &lt;a href=&quot;#1&quot;&gt;[1]&lt;/a&gt; &amp;#x6700;&amp;#x521D;&amp;#x63D0;&amp;#x51FA;&amp;#x7684;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784; (cascade structure)&amp;#xFF0C; &amp;#x5176;&amp;#x6838;&amp;#x5FC3;&amp;#x601D;&amp;#x60F3;&amp;#x5C31;&amp;#x662F;&amp;#xFF0C; &amp;#x8BA9;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x6240;&amp;#x6709;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668; (weak classifiers) &amp;#x7684;&amp;#x6982;&amp;#x7387;&amp;#x5C3D;&amp;#x53EF;&amp;#x80FD;&amp;#x4F4E;&amp;#xFF0C;&amp;#x540C;&amp;#x65F6;&amp;#x4FDD;&amp;#x8BC1;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x6BCF;&amp;#x5C42;&amp;#x7531;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x7EC4;&amp;#x6210;&amp;#x7684;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#xFF08;strong classifier&amp;#xFF09;&amp;#x7684;&amp;#x6700;&amp;#x4F4E;&amp;#x6982;&amp;#x7387;&amp;#xFF0C; &amp;#x8FBE;&amp;#x5230;&amp;#x9AD8;&amp;#x68C0;&amp;#x6D4B;&amp;#x7387;&amp;#x4F4E;&amp;#x9519;&amp;#x68C0;&amp;#x7387;&amp;#x7684;&amp;#x76EE;&amp;#x7684;&amp;#x3002; &amp;#x5728;&amp;#x56FE; 2-1 &amp;#x4E2D;&amp;#xFF0C; &amp;#x4EE5;&amp;#x51B3;&amp;#x7B56;&amp;#x6811; (CART) &amp;#x4F5C;&amp;#x4E3A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x4E3A;&amp;#x4F8B;&amp;#xFF0C; &amp;#x56FE;2-1&amp;#xFF08;a&amp;#xFF09;&amp;#x8868;&amp;#x793A;&amp;#x8F93;&amp;#x5165;&amp;#x7684;&amp;#x56FE;&amp;#x50CF;&amp;#xFF0C; &amp;#x56FE;2-1&amp;#xFF08;b-g&amp;#xFF09;&amp;#x7EFF;&amp;#x8272;&amp;#x77E9;&amp;#x5F62;&amp;#x8868;&amp;#x793A;&amp;#x7ECF;&amp;#x8FC7;&amp;#x82E5;&amp;#x5E72;&amp;#x5C42;&amp;#x540E;&amp;#x5269;&amp;#x4E0B;&amp;#x7684;&amp;#x5019;&amp;#x9009;&amp;#x76EE;&amp;#x6807;&amp;#x533A;&amp;#x57DF;&amp;#xFF0C; &amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x51FA;&amp;#xFF0C; &amp;#x7ECF;&amp;#x8FC7; $ 20 $ &amp;#x5C42;&amp;#x540E;&amp;#x5269;&amp;#x4E0B;&amp;#x7684;&amp;#x5019;&amp;#x9009;&amp;#x76EE;&amp;#x6807;&amp;#x533A;&amp;#x57DF;&amp;#x96C6;&amp;#x4E2D;&amp;#x8986;&amp;#x76D6;&amp;#x5728;&amp;#x4EBA;&amp;#x8138;&amp;#x6240;&amp;#x5728;&amp;#x7684;&amp;#x533A;&amp;#x57DF;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E9B;&amp;#x533A;&amp;#x57DF;&amp;#x7136;&amp;#x540E;&amp;#x7EE7;&amp;#x7EED;&amp;#x88AB;&amp;#x9001;&amp;#x5230;&amp;#x540E;&amp;#x7EED;&amp;#x7684;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x3002; &amp;#x56FE;2-1&amp;#xFF08;h&amp;#xFF09;&amp;#x8868;&amp;#x793A;&amp;#x7ECF;&amp;#x8FC7;&amp;#x6240;&amp;#x6709;&amp;#x5C42;&amp;#x540E;&amp;#x6700;&amp;#x7EC8;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#xFF0C; &amp;#x53EF;&amp;#x4EE5;&amp;#x89C2;&amp;#x5BDF;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x533A;&amp;#x57DF;&amp;#x53EF;&amp;#x4EE5;&amp;#x987A;&amp;#x5229;&amp;#x901A;&amp;#x8FC7;&amp;#x8FD9;&amp;#x4E9B;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#xFF0C; &amp;#x800C;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x5219;&amp;#x88AB;&amp;#x57FA;&amp;#x672C;&amp;#x8FC7;&amp;#x6EE4;&amp;#x4E86;&amp;#x3002;  &lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/1.png&quot; alt=&quot;&amp;#x56FE;2-1 &amp;#x5728;lena&amp;#x56FE;&amp;#x4E0A;&amp;#x4F7F;&amp;#x7528;NPDFace&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x5668; [[21]](#21) &amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x3002; &amp;#x7EFF;&amp;#x8272;&amp;#x77E9;&amp;#x5F62;&amp;#x4E3A;&amp;#x7ECF;&amp;#x8FC7;&amp;#x4E0D;&amp;#x540C;&amp;#x5C42;&amp;#x6570;&amp;#x6240;&amp;#x5269;&amp;#x4E0B;&amp;#x7684;&amp;#x5019;&amp;#x9009;&amp;#x4EBA;&amp;#x8138;&amp;#x533A;&amp;#x57DF; &quot;&gt; &amp;#x56FE;2-1 &amp;#x5728;lena&amp;#x56FE;&amp;#x4E0A;&amp;#x4F7F;&amp;#x7528;NPDFace&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x5668; &lt;a href=&quot;#21&quot;&gt;[21]&lt;/a&gt; &amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x3002; &amp;#x7EFF;&amp;#x8272;&amp;#x77E9;&amp;#x5F62;&amp;#x4E3A;&amp;#x7ECF;&amp;#x8FC7;&amp;#x4E0D;&amp;#x540C;&amp;#x5C42;&amp;#x6570;&amp;#x6240;&amp;#x5269;&amp;#x4E0B;&amp;#x7684;&amp;#x5019;&amp;#x9009;&amp;#x4EBA;&amp;#x8138;&amp;#x533A;&amp;#x57DF;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;Viola &amp;#x548C; Jones &amp;#x6210;&amp;#x529F;&amp;#x5C06; AdaBoost &amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x65B9;&amp;#x6CD5; &lt;a href=&quot;#22&quot;&gt;[22]&lt;/a&gt; &amp;#x5F15;&amp;#x5165;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x4E2D;&amp;#xFF0C; &amp;#x5728;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#1&quot;&gt;[1]&lt;/a&gt;&lt;a href=&quot;#2&quot;&gt;[2]&lt;/a&gt; &amp;#x4E2D;&amp;#x91C7;&amp;#x7528; Haar &amp;#x7279;&amp;#x5F81;&amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#xFF0C; &amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x7B80;&amp;#x5355;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-2(a)&amp;#x3002; &amp;#x63D0;&amp;#x51FA;&amp;#x7684;&amp;#x79EF;&amp;#x5206;&amp;#x56FE;&amp;#x6982;&amp;#x5FF5;&amp;#xFF0C; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x52A0;&amp;#x5FEB;&amp;#x4E86;&amp;#x7279;&amp;#x5F81;&amp;#x63D0;&amp;#x53D6;&amp;#x6548;&amp;#x7387;&amp;#xFF0C; &amp;#x7136;&amp;#x540E;&amp;#x901A;&amp;#x8FC7; $ 20 $ &amp;#x5C42; AdaBoost &amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5FEB;&amp;#x901F;&amp;#x8FC7;&amp;#x6EE4;&amp;#x6389;&amp;#x975E;&amp;#x4EBA;&amp;#x8138;&amp;#x533A;&amp;#x57DF;&amp;#x3002; &amp;#x7ECF;&amp;#x5178;&amp;#x7684;&amp;#x7EA7;&amp;#x8054; AdaBoost &amp;#x7B97;&amp;#x6CD5;&amp;#x91C7;&amp;#x7528;&amp;#x5355;&amp;#x5C42;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#xFF08;stump&amp;#xFF09;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x3002; &amp;#x8BAD;&amp;#x7EC3;&amp;#x65F6;&amp;#xFF0C; &amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x52A0;&amp;#x6743;&amp;#x9519;&amp;#x8BEF;&amp;#x4E3A;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;$$ \epsilon_i = min \sum_j w_j|h(x_i)-y_i|   $$&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4E2D;&amp;#xFF0C; $ \epsilon_i $ &amp;#x4E3A;&amp;#x7B2C;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x5206;&amp;#x7C7B;&amp;#x9519;&amp;#x8BEF;&amp;#xFF0C; $ w_j $ &amp;#x4E3A;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6837;&amp;#x672C;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#xFF0C;$ y_i \in [1,0] $ &amp;#x8868;&amp;#x793A;&amp;#x6837;&amp;#x672C;&amp;#x4E3A;&amp;#x4EBA;&amp;#x8138;&amp;#x4E0E;&amp;#x975E;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; $ h(x_i) $ &amp;#x4E3A;&amp;#x5F53;&amp;#x524D;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5BF9;&amp;#x6837;&amp;#x672C; $ x_i $ &amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x5F97;&amp;#x5206;&amp;#x3002; &amp;#x6BCF;&amp;#x6B21;&amp;#x8BAD;&amp;#x7EC3;&amp;#x5F97;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x90FD;&amp;#x4F1A;&amp;#x5BF9;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6837;&amp;#x672C;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#x91CD;&amp;#x65B0;&amp;#x8FDB;&amp;#x884C;&amp;#x8C03;&amp;#x6574;&amp;#xFF0C; &amp;#x964D;&amp;#x4F4E;&amp;#x5206;&amp;#x7C7B;&amp;#x6B63;&amp;#x786E;&amp;#x7684;&amp;#x6837;&amp;#x672C;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#xFF0C; &amp;#x5206;&amp;#x7C7B;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#x6837;&amp;#x672C;&amp;#x5219;&amp;#x4E0E;&amp;#x4E4B;&amp;#x76F8;&amp;#x53CD;&amp;#xFF0C; &amp;#x4ECE;&amp;#x800C;&amp;#x4F7F;&amp;#x5F97;&amp;#x540E;&amp;#x7EED;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x9488;&amp;#x5BF9;&amp;#x5206;&amp;#x7C7B;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#x6837;&amp;#x672C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#xFF0C; &amp;#x7A97;&amp;#x53E3; $ x $ &amp;#x7ECF;&amp;#x8FC7;&amp;#x7531;&amp;#x82E5;&amp;#x5E72;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7EC4;&amp;#x6210;&amp;#x7684; AdaBoost &amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x8F93;&amp;#x51FA;&amp;#x4E3A;:&lt;/p&gt;
&lt;p&gt;$$  C(x) = \begin{cases} 1, \sum_{i}^{T} \alpha_i h_i(x) \gt  \eta \\ 0, otherwise \end{cases} , &amp;#x5176;&amp;#x4E2D; \alpha_i = log\frac{1-\epsilon_i}{\epsilon_i}  $$&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4E2D; $ \eta $ &amp;#x4E3A;&amp;#x4FDD;&amp;#x8BC1;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x8BE5;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x6982;&amp;#x7387;&amp;#x81F3;&amp;#x591A;&amp;#x4E3A; $ p_f $&amp;#xFF0C; &amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x6982;&amp;#x7387;&amp;#x81F3;&amp;#x5C11;&amp;#x4E3A;&amp;#x7684;&amp;#x9608;&amp;#x503C; $ p_t $(&amp;#x5982; $ p_f = 0.5, p_t = 0.95 $)&amp;#xFF0C; &amp;#x7ECF;&amp;#x8FC7; $ 20 $ &amp;#x5C42;&amp;#x540E;&amp;#xFF0C; &amp;#x6B63;&amp;#x3001;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x6240;&amp;#x6709;&amp;#x5C42;&amp;#x7684;&amp;#x6982;&amp;#x7387;&amp;#x5206;&amp;#x522B;&amp;#x4E3A; $ 0.95^{20} &amp;gt; 0.9, 0.5^{20}&amp;lt; 10^{-6} $&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/2.png&quot; alt=&quot; Haar &amp;#x7279;&amp;#x5F81;&amp;#x793A;&amp;#x4F8B; &quot;&gt;&amp;#xFF08;a&amp;#xFF09;Haar &amp;#x7279;&amp;#x5F81;&amp;#x793A;&amp;#x4F8B;&amp;#x3002;&amp;#x7070;&amp;#x8272;&amp;#x77E9;&amp;#x5F62;&amp;#x5185;&amp;#x50CF;&amp;#x7D20;&amp;#x548C;&amp;#x51CF;&amp;#x53BB;&amp;#x767D;&amp;#x8272;&amp;#x77E9;&amp;#x5F62;&amp;#x5185;&amp;#x50CF;&amp;#x7D20;&amp;#x548C;&amp;#x4E3A; Haar &amp;#x7279;&amp;#x5F81;&amp;#x8BA1;&amp;#x7B97;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#1&quot;&gt;[1]&lt;/a&gt;&lt;a href=&quot;#2&quot;&gt;[2]&lt;/a&gt; &amp;#x91C7;&amp;#x7528;&amp;#x7070;&amp;#x5EA6;&amp;#x56FE;&amp;#x8FDB;&amp;#x884C;&amp;#x8BA1;&amp;#x7B97;&lt;br&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/3.png&quot; alt=&quot; &amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81; &quot;&gt;&amp;#xFF08;b&amp;#xFF09;&amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C;&amp;#x4ECE;&amp;#x5DE6;&amp;#x5230;&amp;#x53F3;&amp;#xFF0C;&amp;#x4ECE;&amp;#x4E0A;&amp;#x5230;&amp;#x4E0B;&amp;#x4F9D;&amp;#x6B21;&amp;#x4E3A;LUV&amp;#x5F69;&amp;#x8272;&amp;#x901A;&amp;#x9053;&amp;#xFF0C;&amp;#x68AF;&amp;#x5EA6;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&amp;#x3001;&amp;#x5728;&amp;#x516D;&amp;#x4E2A;&amp;#x65B9;&amp;#x5411;&amp;#x4E0A;&amp;#x7684;&amp;#x68AF;&amp;#x5EA6;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&lt;br&gt;&amp;#x56FE;2-2 &amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x7EA7;&amp;#x8054; Adaboost &amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x4EE5;&amp;#x5176;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C; &amp;#x9AD8;&amp;#x6548;&amp;#x7684;&amp;#x5B9E;&amp;#x65F6;&amp;#x6027;&amp;#x800C;&amp;#x5E7F;&amp;#x53D7;&amp;#x6B22;&amp;#x8FCE;&amp;#x3002; &amp;#x4F46;&amp;#x5176;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x8FDB;&amp;#x884C;&amp;#x63CF;&amp;#x8FF0;&amp;#x7684; Haar &amp;#x7279;&amp;#x5F81;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x89D2;&amp;#x5EA6;&amp;#x3001;&amp;#x5149;&amp;#x7167;&amp;#x53D8;&amp;#x5316;&amp;#x3001;&amp;#x6A21;&amp;#x7CCA;&amp;#x3001;&amp;#x8868;&amp;#x60C5;&amp;#x53D8;&amp;#x5316;&amp;#x7B49;&amp;#x590D;&amp;#x6742;&amp;#x60C5;&amp;#x51B5;&amp;#x9002;&amp;#x5E94;&amp;#x6027;&amp;#x8F83;&amp;#x5DEE;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#4&quot;&gt;[4]&lt;/a&gt;&lt;a href=&quot;#5&quot;&gt;[5]&lt;/a&gt; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x6269;&amp;#x5C55;&amp;#x4E86; Haar &amp;#x7279;&amp;#x5F81;&amp;#x4EE5;&amp;#x9002;&amp;#x5E94;&amp;#x66F4;&amp;#x591A;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x6A21;&amp;#x5F0F;&amp;#x3002; &amp;#x9488;&amp;#x5BF9; Haar &amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#x5DEE;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#18&quot;&gt;[18]&lt;/a&gt;&lt;a href=&quot;#223&quot;&gt;[23]&lt;/a&gt; &amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x57FA;&amp;#x4E8E;&amp;#x66F4;&amp;#x5F3A;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#x7684;SURF &lt;a href=&quot;#25&quot;&gt;[25]&lt;/a&gt; &amp;#x7279;&amp;#x5F81;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528; CPU &amp;#x5E76;&amp;#x884C;&amp;#x5904;&amp;#x7406;&amp;#x6280;&amp;#x672F;&amp;#x53CA;&amp;#x79EF;&amp;#x5206;&amp;#x56FE;&amp;#x52A0;&amp;#x901F;&amp;#x7279;&amp;#x5F81;&amp;#x8BA1;&amp;#x7B97;&amp;#x3002; &amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x4E2D;&amp;#x7EB9;&amp;#x7406;&amp;#x7279;&amp;#x5F81;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x6BD4;&amp;#x8F83;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#26&quot;&gt;[26]&lt;/a&gt; &amp;#x6307;&amp;#x51FA;&amp;#x7EB9;&amp;#x7406;&amp;#x5206;&amp;#x5E03;&amp;#x6BD4;&amp;#x7EB9;&amp;#x7406;&amp;#x5F3A;&amp;#x5EA6;&amp;#x66F4;&amp;#x6709;&amp;#x5229;&amp;#x4E8E;&amp;#x5206;&amp;#x7C7B;&amp;#xFF0C; &amp;#x6539;&amp;#x8FDB;&amp;#x4E86;&amp;#x7EB9;&amp;#x7406;&amp;#x7279;&amp;#x5F81; LBP &lt;a href=&quot;#27&quot;&gt;[27]&lt;/a&gt; &amp;#x6765;&amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x8868;&amp;#x8FBE;&amp;#x3002; &amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x4ECE;&amp;#x7070;&amp;#x5EA6;&amp;#x56FE;&amp;#x7279;&amp;#x5F81;&amp;#x63D0;&amp;#x53D6;&amp;#xFF0C; &amp;#x5F69;&amp;#x8272;&amp;#x901A;&amp;#x9053;&amp;#x7531;&amp;#x4E8E;&amp;#x7279;&amp;#x5F81;&amp;#x63D0;&amp;#x53D6;&amp;#x56F0;&amp;#x96BE;&amp;#x800C;&amp;#x88AB;&amp;#x5FFD;&amp;#x89C6;&amp;#xFF0C; &amp;#x800C;&amp;#x4EBA;&amp;#x8138;&amp;#x8F6E;&amp;#x5ED3;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x80FD;&amp;#x529B;&amp;#x5F3A;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#28&quot;&gt;[28]&lt;/a&gt; &amp;#x521B;&amp;#x9020;&amp;#x6027;&amp;#x5730;&amp;#x5F15;&amp;#x5165;&amp;#x4E86;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#29&quot;&gt;[29]&lt;/a&gt; &amp;#x4E2D;&amp;#x9488;&amp;#x5BF9;&amp;#x884C;&amp;#x4EBA;&amp;#x68C0;&amp;#x6D4B;&amp;#x800C;&amp;#x63D0;&amp;#x51FA;&amp;#x7684;&amp;#x57FA;&amp;#x4E8E; LUV &amp;#x989C;&amp;#x8272;&amp;#x901A;&amp;#x9053;&amp;#x53CA; HOG &amp;#x7279;&amp;#x5F81; &lt;a href=&quot;#30&quot;&gt;[30]&lt;/a&gt; &amp;#x7684;&amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x9886;&amp;#x57DF;&amp;#xFF0C; &amp;#x8FD0;&amp;#x7528;&amp;#x79EF;&amp;#x5206;&amp;#x56FE;&amp;#x52A0;&amp;#x901F;&amp;#x7279;&amp;#x5F81;&amp;#x8BA1;&amp;#x7B97;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-2&amp;#xFF08;b&amp;#xFF09;&amp;#x6240;&amp;#x793A;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#17&quot;&gt;[17]&lt;/a&gt; &amp;#x5219;&amp;#x4ECE;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#31&quot;&gt;[31]&lt;/a&gt; &amp;#x5F97;&amp;#x5230;&amp;#x7075;&amp;#x611F;&amp;#xFF0C;&amp;#x53BB;&amp;#x9664;&amp;#x4E86;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#28&quot;&gt;[28]&lt;/a&gt; &amp;#x79EF;&amp;#x5206;&amp;#x56FE;&amp;#x7684;&amp;#x64CD;&amp;#x4F5C;&amp;#xFF0C; &amp;#x5728;&amp;#x7279;&amp;#x5F81;&amp;#x9009;&amp;#x62E9;&amp;#x65F6;&amp;#x76F4;&amp;#x63A5;&amp;#x4ECE;&amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x4E2D;&amp;#x9009;&amp;#x53D6;&amp;#xFF0C; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x7B80;&amp;#x5316;&amp;#x4E86;&amp;#x7279;&amp;#x5F81;&amp;#x63D0;&amp;#x53D6;&amp;#x8FC7;&amp;#x7A0B;&amp;#xFF0C; &amp;#x5E76;&amp;#x53D6;&amp;#x5F97;&amp;#x4E0D;&amp;#x9519;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x9664;&amp;#x4E86;&amp;#x5BF9;&amp;#x7279;&amp;#x5F81;&amp;#x7684;&amp;#x6539;&amp;#x8FDB;&amp;#xFF0C; &amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x540C;&amp;#x6837;&amp;#x4E5F;&amp;#x6210;&amp;#x4E3A;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x5173;&amp;#x6CE8;&amp;#x7684;&amp;#x91CD;&amp;#x70B9;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#5&quot;&gt;[5]&lt;/a&gt; &amp;#x6307;&amp;#x51FA; Gentle Adaboost &amp;#x6BD4;&amp;#x539F;&amp;#x6765;&amp;#x7684; Discrete Adaboost &amp;#x7B97;&amp;#x6CD5;&amp;#x5206;&amp;#x7C7B;&amp;#x6548;&amp;#x679C;&amp;#x66F4;&amp;#x597D;&amp;#xFF0C; &amp;#x6DF1;&amp;#x5C42;&amp;#x7684;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#x9700;&amp;#x8981;&amp;#x66F4;&amp;#x5C11;&amp;#x7684;&amp;#x7EA7;&amp;#x8054;&amp;#x5C42;&amp;#x6570;&amp;#x3002; &amp;#x8BAD;&amp;#x7EC3;&amp;#x65F6;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x8981;&amp;#x5C3D;&amp;#x53EF;&amp;#x80FD;&amp;#x5730;&amp;#x53EF;&amp;#x4EE5;&amp;#x901A;&amp;#x8FC7;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#xFF0C; &amp;#x56E0;&amp;#x6B64;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5BF9;&amp;#x635F;&amp;#x5931;&amp;#x51FD;&amp;#x6570;&amp;#x7684;&amp;#x5F71;&amp;#x54CD;&amp;#x6BD4;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x8FDC;&amp;#x8FDC;&amp;#x8981;&amp;#x5927;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#32&quot;&gt;[32]&lt;/a&gt; &amp;#x901A;&amp;#x8FC7;&amp;#x964D;&amp;#x4F4E;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5BF9;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x5F97;&amp;#x5206;&amp;#xFF0C; &amp;#x4ECE;&amp;#x800C;&amp;#x4F7F;&amp;#x5F97;&amp;#x540E;&amp;#x7EED;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x66F4;&amp;#x597D;&amp;#x5730;&amp;#x9488;&amp;#x5BF9;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x3002; &amp;#x5728;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#3&quot;&gt;[3]&lt;/a&gt; &amp;#x4E2D;&amp;#x5C06;&amp;#x6BCF;&amp;#x5C42;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5F97;&amp;#x5206;&amp;#x6539;&amp;#x8FDB;&amp;#x4E3A;&amp;#x5F53;&amp;#x524D;&amp;#x5C42;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x4E0E;&amp;#x524D;&amp;#x9762;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x7D2F;&amp;#x79EF;&amp;#x548C;&amp;#xFF0C; &amp;#x5E76;&amp;#x5C06;&amp;#x5BF9;&amp;#x5206;&amp;#x7C7B;&amp;#x6548;&amp;#x679C;&amp;#x65E0;&amp;#x5F71;&amp;#x54CD;&amp;#x7684;&amp;#x5DF2;&amp;#x8BAD;&amp;#x7EC3;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x8FDB;&amp;#x884C;&amp;#x4E86;&amp;#x79FB;&amp;#x9664;&amp;#xFF0C; &amp;#x9C81;&amp;#x68D2;&amp;#x6027;&amp;#x66F4;&amp;#x5F3A;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#24&quot;&gt;[24]&lt;/a&gt; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x5C06;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7B80;&amp;#x5316;&amp;#x4E3A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#xFF0C; &amp;#x7ECF;&amp;#x8FC7;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5219;&amp;#x8FDB;&amp;#x884C;&amp;#x4E00;&amp;#x6B21;&amp;#x5224;&amp;#x65AD;&amp;#xFF0C; &amp;#x6BCF;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x8F93;&amp;#x51FA;&amp;#x4E3A;&amp;#x5F53;&amp;#x524D;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x4E0E;&amp;#x4E4B;&amp;#x524D;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x7D2F;&amp;#x52A0;&amp;#x3002; &amp;#x5355;&amp;#x4E2A;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#x533A;&amp;#x5206;&amp;#x80FD;&amp;#x529B;&amp;#x8F83;&amp;#x5F31;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#18&quot;&gt;[18]&lt;/a&gt; &amp;#x4F7F;&amp;#x7528;&amp;#x903B;&amp;#x8F91;&amp;#x56DE;&amp;#x5F52;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x4F5C;&amp;#x4E3A;&amp;#x6BCF;&amp;#x5C42;&amp;#x7684;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#xFF0C; &amp;#x9608;&amp;#x503C;&amp;#x4F9D;&amp;#x636E;&amp;#x66F2;&amp;#x7EBF;&amp;#x7684; AUC&amp;#xFF08;area under curve&amp;#xFF09; &amp;#x5927;&amp;#x5C0F;&amp;#x6765;&amp;#x8BBE;&amp;#x7F6E;&amp;#xFF0C; &amp;#x589E;&amp;#x5F3A;&amp;#x4E86;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x7684;&amp;#x6982;&amp;#x7387;&amp;#x540C;&amp;#x65F6;&amp;#x5927;&amp;#x5927;&amp;#x964D;&amp;#x4F4E;&amp;#x4E86;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x901A;&amp;#x8FC7;&amp;#x7684;&amp;#x6982;&amp;#x7387;&amp;#xFF0C; &amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x68C0;&amp;#x6D4B;&amp;#x7684;&amp;#x9636;&amp;#x6BB5;&amp;#x6570;&amp;#x76EE;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#33&quot;&gt;[33]&lt;/a&gt; &amp;#x901A;&amp;#x8FC7;&amp;#x63A8;&amp;#x5BFC;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x4E24;&amp;#x79CD;&amp;#x4E00;&amp;#x822C;&amp;#x5316;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C; &amp;#x9488;&amp;#x5BF9;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x53E0;&amp;#x52A0;&amp;#x53EF;&amp;#x80FD;&amp;#x5BFC;&amp;#x81F4;&amp;#x7684;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x4F18;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C; &amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x5728;&amp;#x5F3A;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x4E0A;&amp;#x4EFB;&amp;#x610F;&amp;#x5C42;&amp;#x52A8;&amp;#x6001;&amp;#x52A0;&amp;#x5165;&amp;#x6700;&amp;#x4F18;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x5C3D;&amp;#x53EF;&amp;#x80FD;&amp;#x4FDD;&amp;#x8BC1;&amp;#x4E86;&amp;#x5168;&amp;#x5C40;&amp;#x6700;&amp;#x4F18;&amp;#xFF0C; &amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x6570;&amp;#x76EE;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x7ED3;&amp;#x5408;&amp;#x5176;&amp;#x4ED6;&amp;#x9886;&amp;#x57DF;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x4E3A;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x672A;&amp;#x6765;&amp;#x6539;&amp;#x8FDB;&amp;#x63D0;&amp;#x4F9B;&amp;#x4E86;&amp;#x601D;&amp;#x8DEF;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#10&quot;&gt;[10]&lt;/a&gt;&lt;a href=&quot;#11&quot;&gt;[11]&lt;/a&gt; &amp;#x7ED3;&amp;#x5408;&amp;#x6587;&amp;#x672C;&amp;#x68C0;&amp;#x7D22;&amp;#x6280;&amp;#x672F;&amp;#xFF0C; &amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x57FA;&amp;#x4E8E;&amp;#x4EBA;&amp;#x8138;&amp;#x8BCD;&amp;#x888B; (face examplar)&amp;#xFF0C; &amp;#x6BCF;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F31;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x8F93;&amp;#x51FA;&amp;#x56FE;&amp;#x50CF;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&amp;#xFF0C; &amp;#x7D2F;&amp;#x79EF;&amp;#x8FD9;&amp;#x4E9B;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&amp;#x5F97;&amp;#x5230;&amp;#x6700;&amp;#x540E;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#x3002;&amp;#x76F8;&amp;#x90BB;&amp;#x7A97;&amp;#x53E3;&amp;#x7684;&amp;#x5F97;&amp;#x5206;&amp;#x6709;&amp;#x4E00;&amp;#x5B9A;&amp;#x7684;&amp;#x8054;&amp;#x7CFB;&amp;#x6027;&amp;#xFF0C; &amp;#x5355;&amp;#x72EC;&amp;#x5904;&amp;#x7406;&amp;#x6BCF;&amp;#x4E2A;&amp;#x7A97;&amp;#x53E3;&amp;#x53EF;&amp;#x80FD;&amp;#x5BFC;&amp;#x81F4;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x8FC7;&amp;#x65E9;&amp;#x5730;&amp;#x88AB;&amp;#x53BB;&amp;#x9664;&amp;#xFF0C; &amp;#x5728;&amp;#x884C;&amp;#x4EBA;&amp;#x68C0;&amp;#x6D4B;&amp;#x9886;&amp;#x57DF;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#34&quot;&gt;[34]&lt;/a&gt; &amp;#x5728;&amp;#x4EFF;&amp;#x7167;&amp;#x4EBA;&amp;#x7684;&amp;#x795E;&amp;#x7ECF;&amp;#x9012;&amp;#x8D28;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x5E26;&amp;#x6709;&amp;#x6FC0;&amp;#x6D3B;&amp;#x4E0E;&amp;#x6291;&amp;#x5236;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#xFF0C; &amp;#x4F7F;&amp;#x5F97;&amp;#x9AD8;&amp;#x5F97;&amp;#x5206;&amp;#x9644;&amp;#x8FD1;&amp;#x7684;&amp;#x7A97;&amp;#x53E3;&amp;#x5F97;&amp;#x5230;&amp;#x589E;&amp;#x5F3A;&amp;#xFF0C; &amp;#x800C;&amp;#x4F4E;&amp;#x5F97;&amp;#x5206;&amp;#x9644;&amp;#x8FD1;&amp;#x7684;&amp;#x7A97;&amp;#x53E3;&amp;#x5F97;&amp;#x5230;&amp;#x6291;&amp;#x5236;&amp;#xFF0C; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x63D0;&amp;#x9AD8;&amp;#x68C0;&amp;#x6D4B;&amp;#x7684;&amp;#x53EC;&amp;#x56DE;&amp;#x7387;&amp;#x548C;&amp;#x51C6;&amp;#x786E;&amp;#x7387;&amp;#xFF0C; &amp;#x4E3A;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x63D0;&amp;#x4F9B;&amp;#x4E86;&amp;#x65B0;&amp;#x601D;&amp;#x8DEF;&amp;#x3002; &amp;#x975E;&amp;#x7EA6;&amp;#x675F;&amp;#x573A;&amp;#x666F;&amp;#x4EBA;&amp;#x8138;&amp;#x5F62;&amp;#x53D8;&amp;#x8F83;&amp;#x5927;&amp;#xFF0C; &amp;#x4EBA;&amp;#x8138;&amp;#x5BF9;&amp;#x9F50;&amp;#x65B9;&amp;#x6CD5; &lt;a href=&quot;#35&quot;&gt;[35]&lt;/a&gt;-&lt;a href=&quot;#38&quot;&gt;[38]&lt;/a&gt;) &amp;#x53EF;&amp;#x4EE5;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#x8FDB;&amp;#x884C;&amp;#x5C40;&amp;#x90E8;&amp;#x62DF;&amp;#x5408;&amp;#x5F97;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#39&quot;&gt;[39]&lt;/a&gt; &amp;#x521B;&amp;#x65B0;&amp;#x6027;&amp;#x5730;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x4E0E;&amp;#x5BF9;&amp;#x9F50;&amp;#x65B9;&amp;#x6CD5;&amp;#x8FDB;&amp;#x884C;&amp;#x7ED3;&amp;#x5408;&amp;#xFF0C; &amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x6BCF;&amp;#x68F5;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#x7684;&amp;#x540C;&amp;#x65F6;&amp;#xFF0C; &amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x8FDB;&amp;#x884C;&amp;#x56DE;&amp;#x5F52;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C; &amp;#x7528;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x6307;&amp;#x5BFC;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7279;&amp;#x5F81;&amp;#x7684;&amp;#x9009;&amp;#x53D6;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;a href=&quot;#&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;/a&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&lt;/h2&gt;&lt;p&gt;&amp;#x5728;&amp;#x975E;&amp;#x7EA6;&amp;#x675F;&amp;#x573A;&amp;#x666F;&amp;#x4E0B;&amp;#xFF0C; &amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x8868;&amp;#x60C5;&amp;#x3001;&amp;#x89D2;&amp;#x5EA6;&amp;#x6240;&amp;#x5E26;&amp;#x6765;&amp;#x7684;&amp;#x5F62;&amp;#x53D8;&amp;#x8F83;&amp;#x5927;&amp;#xFF0C; &amp;#x906E;&amp;#x6321;&amp;#x53CA;&amp;#x5149;&amp;#x7167;&amp;#x53D8;&amp;#x5316;&amp;#x4F1A;&amp;#x5F15;&amp;#x5165;&amp;#x566A;&amp;#x58F0;&amp;#x3002; &amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x5F80;&amp;#x5F80;&amp;#x662F;&amp;#x5BF9;&amp;#x9884;&amp;#x5148;&amp;#x5B66;&amp;#x4E60;&amp;#x5230;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x63D0;&amp;#x53D6;&amp;#x5206;&amp;#x7C7B;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C; &amp;#x5BF9;&amp;#x906E;&amp;#x6321;&amp;#x7B49;&amp;#x566A;&amp;#x58F0;&amp;#x9002;&amp;#x5E94;&amp;#x6027;&amp;#x8F83;&amp;#x5DEE;&amp;#x3002; &amp;#x53E6;&amp;#x5916;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E9B;&amp;#x65B9;&amp;#x6CD5;&amp;#x5C06;&amp;#x4E0D;&amp;#x540C;&amp;#x8868;&amp;#x60C5;&amp;#x3001;&amp;#x4E0D;&amp;#x540C;&amp;#x89D2;&amp;#x5EA6;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x5F53;&amp;#x6210;&amp;#x591A;&amp;#x4E2A;&amp;#x5B50;&amp;#x7C7B;&amp;#x5904;&amp;#x7406;&amp;#xFF0C; &amp;#x5728;&amp;#x9884;&amp;#x6D4B;&amp;#x65F6;&amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#x6BCF;&amp;#x4E2A;&amp;#x8282;&amp;#x70B9;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x5212;&amp;#x5206;&amp;#x5230;&amp;#x6A21;&amp;#x5F0F;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x7C07; (batch) &amp;#x63D0;&amp;#x53D6;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C; &amp;#x5BF9;&amp;#x4E8E;&amp;#x5F62;&amp;#x53D8;&amp;#x8FC7;&amp;#x5927;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x51B3;&amp;#x7B56;&amp;#x6811;&amp;#x53EF;&amp;#x80FD;&amp;#x4F1A;&amp;#x5C06;&amp;#x5176;&amp;#x5212;&amp;#x5206;&amp;#x5230;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#x8282;&amp;#x70B9;&amp;#x4E0A;&amp;#xFF0C; &amp;#x5C06;&amp;#x5176;&amp;#x8FC7;&amp;#x65E9;&amp;#x5730;&amp;#x8FC7;&amp;#x6EE4;&amp;#x6389;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/4.png&quot; alt=&quot; TSM &quot;&gt;(a)&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt; &amp;#x6240;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x6DF7;&amp;#x5408;&amp;#x6811;&amp;#x6A21;&amp;#x578B;&amp;#x793A;&amp;#x4F8B;&lt;br&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/5.png&quot; alt=&quot; MutiresHPM &quot;&gt;(b)&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#40&quot;&gt;[40]&lt;/a&gt; &amp;#x5E26;&amp;#x906E;&amp;#x6321;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x5F39;&amp;#x6027;&amp;#x6A21;&amp;#x578B;&amp;#x793A;&amp;#x4F8B;&amp;#x3002; &amp;#x7EA2;&amp;#x8272;&amp;#x4E3A;&amp;#x906E;&amp;#x6321;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;, &amp;#x7EFF;&amp;#x8272;&amp;#x4E3A;&amp;#x53EF;&amp;#x89C1;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;, &amp;#x53F3;&amp;#x56FE;&amp;#x4E3A;&amp;#x4EBA;&amp;#x8138;&amp;#x5C3A;&amp;#x5EA6;&amp;#x8F83;&amp;#x5C0F;&amp;#x65F6;&amp;#x7684;&amp;#x6A21;&amp;#x578B;&lt;br&gt;&amp;#x56FE; 2-3 &amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x793A;&amp;#x4F8B;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B; &lt;a href=&quot;#7&quot;&gt;[7]&lt;/a&gt;&lt;a href=&quot;#8&quot;&gt;[8]&lt;/a&gt; &amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x53EF;&amp;#x4EE5;&amp;#x6709;&amp;#x6548;&amp;#x89E3;&amp;#x51B3;&amp;#x5982;&amp;#x906E;&amp;#x6321;&amp;#x3001;&amp;#x5149;&amp;#x7167;&amp;#x53D8;&amp;#x5316;&amp;#x3001;&amp;#x8868;&amp;#x60C5;&amp;#x53D8;&amp;#x5316;&amp;#x3001;&amp;#x89D2;&amp;#x5EA6;&amp;#x4E0D;&amp;#x4E00;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002; &amp;#x8FD9;&amp;#x7C7B;&amp;#x65B9;&amp;#x6CD5;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E3A;&amp;#x4EBA;&amp;#x8138;&amp;#x4E0D;&amp;#x540C;&amp;#x90E8;&amp;#x4F4D; (parts) &amp;#x7684;&amp;#x7EC4;&amp;#x5408;&amp;#xFF0C; &amp;#x5982;&amp;#x9F3B;&amp;#x5B50;&amp;#x3001;&amp;#x773C;&amp;#x775B;&amp;#x3001;&amp;#x5634;&amp;#x3001;&amp;#x8033;&amp;#x6735;&amp;#x7B49;&amp;#xFF0C; &amp;#x8FD9;&amp;#x4E9B;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x90E8;&amp;#x4F4D;&amp;#x901A;&amp;#x8FC7;&amp;#x201C;&amp;#x5F39;&amp;#x7C27; (spring)&amp;#x201D;&amp;#x8FDB;&amp;#x884C;&amp;#x7EC4;&amp;#x5408;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-3 &amp;#x6240;&amp;#x793A;&amp;#x3002; &amp;#x8FD9;&amp;#x4E9B;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#x7531;&amp;#x975E;&amp;#x76D1;&amp;#x7763;&amp;#x6216;&amp;#x8005;&amp;#x76D1;&amp;#x7763;&amp;#x7B97;&amp;#x6CD5;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x5F97;&amp;#x5230;&amp;#x3002; Latent SVM &amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x88AB;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6765;&amp;#x5728;&amp;#x4EBA;&amp;#x8138;&amp;#x4E0A;&amp;#x627E;&amp;#x5230;&amp;#x8FD9;&amp;#x4E9B;&amp;#x90E8;&amp;#x4F4D;&amp;#x53CA;&amp;#x4ED6;&amp;#x4EEC;&amp;#x95F4;&amp;#x7684;&amp;#x51E0;&amp;#x4F55;&amp;#x5173;&amp;#x7CFB;&amp;#xFF0C; &amp;#x56E0;&amp;#x6B64;&amp;#x8BE5;&amp;#x7C7B;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EF;&amp;#x4EE5;&amp;#x9002;&amp;#x5E94;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x5F62;&amp;#x53D8;&amp;#x3002; &amp;#x53C8;&amp;#x7531;&amp;#x4E8E;&amp;#x662F;&amp;#x5BF9;&amp;#x5C40;&amp;#x90E8;&amp;#x90E8;&amp;#x4F4D;&amp;#x8FDB;&amp;#x884C;&amp;#x7279;&amp;#x5F81;&amp;#x63D0;&amp;#x53D6;&amp;#xFF0C; &amp;#x56E0;&amp;#x6B64;&amp;#xFF0C; &amp;#x8FD9;&amp;#x7C7B;&amp;#x65B9;&amp;#x6CD5;&amp;#x8FD8;&amp;#x80FD;&amp;#x68C0;&amp;#x6D4B;&amp;#x5230;&amp;#x6709;&amp;#x90E8;&amp;#x5206;&amp;#x906E;&amp;#x6321;&amp;#x7684;&amp;#x4EBA;&amp;#x8138; (&amp;#x5982;&amp;#x56FE; 2-4 &amp;#x6240;&amp;#x793A;)&amp;#xFF0C; &amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x906E;&amp;#x6321;&amp;#x60C5;&amp;#x51B5;&amp;#x6709;&amp;#x5F88;&amp;#x597D;&amp;#x7684;&amp;#x9C81;&amp;#x68D2;&amp;#x6027;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x9700;&amp;#x8981;&amp;#x7684;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6570;&amp;#x636E;&amp;#x5F80;&amp;#x5F80;&amp;#x6BD4;&amp;#x8F83;&amp;#x5927;&amp;#xFF0C; &amp;#x5728;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt; &amp;#x4E2D;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E3A;&amp;#x82E5;&amp;#x5E72;&amp;#x4E2A;&amp;#x6DF7;&amp;#x5408;&amp;#x6811;&amp;#x6A21;&amp;#x578B;&amp;#xFF0C; &amp;#x6BCF;&amp;#x4E2A;&amp;#x5B50;&amp;#x8282;&amp;#x70B9;&amp;#x5747;&amp;#x7531;&amp;#x4E00;&amp;#x4E2A;&amp;#x7236;&amp;#x8282;&amp;#x70B9;&amp;#x5173;&amp;#x8054;&amp;#xFF0C; &amp;#x53EA;&amp;#x9700;&amp;#x8981;&amp;#x51E0;&amp;#x767E;&amp;#x5F20;&amp;#x6807;&amp;#x8BB0;&amp;#x6709;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x4F4D;&amp;#x7F6E;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6570;&amp;#x636E;&amp;#x5C31;&amp;#x53EF;&amp;#x4EE5;&amp;#x5B66;&amp;#x4E60;&amp;#x5230;&amp;#x4E0D;&amp;#x540C;&amp;#x6A21;&amp;#x5F0F;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x800C;&amp;#x4E14;&amp;#x5728;&amp;#x68C0;&amp;#x6D4B;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x540C;&amp;#x65F6;&amp;#x5224;&amp;#x65AD;&amp;#x4E86;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x89D2;&amp;#x5EA6;&amp;#x53CA;&amp;#x6807;&amp;#x5B9A;&amp;#x70B9;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#40&quot;&gt;[40]&lt;/a&gt; &amp;#x5728;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt; &amp;#x57FA;&amp;#x7840;&amp;#x4E0A;&amp;#x6269;&amp;#x5C55;&amp;#x4E86;&amp;#x6DF7;&amp;#x5408;&amp;#x6811;&amp;#x6A21;&amp;#x578B;&amp;#x6765;&amp;#x5904;&amp;#x7406;&amp;#x906E;&amp;#x6321;&amp;#xFF0C; &amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#x8FDB;&amp;#x884C;&amp;#x5206;&amp;#x7EA7;&amp;#xFF0C; &amp;#x5982;&amp;#x773C;&amp;#x775B;&amp;#x3001;&amp;#x9F3B;&amp;#x5B50;&amp;#x3001;&amp;#x5634;&amp;#x5DF4;&amp;#x4E3A;&amp;#x4E00;&amp;#x7EA7;&amp;#xFF0C; &amp;#x8FD9;&amp;#x4E9B;&amp;#x4F4D;&amp;#x7F6E;&amp;#x9644;&amp;#x8FD1;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x4E3A;&amp;#x7B2C;&amp;#x4E8C;&amp;#x7EA7;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-3(b)&amp;#x3002; &amp;#x8BAD;&amp;#x7EC3;&amp;#x65F6;&amp;#x968F;&amp;#x673A;&amp;#x751F;&amp;#x6210;&amp;#x5E26;&amp;#x906E;&amp;#x6321;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#x5F53;&amp;#x4EBA;&amp;#x8138;&amp;#x67D0;&amp;#x4E2A;&amp;#x90E8;&amp;#x4F4D;&amp;#x88AB;&amp;#x906E;&amp;#x6321;&amp;#x65F6;&amp;#xFF0C; &amp;#x5BF9;&amp;#x5206;&amp;#x7C7B;&amp;#x65E0;&amp;#x6548;&amp;#x3002; &amp;#x5C3D;&amp;#x7BA1;&amp;#x8FD9;&amp;#x4E9B;&amp;#x53D8;&amp;#x5F62;&amp;#x91C7;&amp;#x7528;&amp;#x4E86;&amp;#x66F4;&amp;#x52A0;&amp;#x590D;&amp;#x6742;&amp;#x7684;&amp;#x7B56;&amp;#x7565;&amp;#x6765;&amp;#x5904;&amp;#x7406;&amp;#x4EBA;&amp;#x8138;&amp;#x53D8;&amp;#x5F62;&amp;#x53CA;&amp;#x906E;&amp;#x6321;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#28&quot;&gt;[28]&lt;/a&gt; &amp;#x901A;&amp;#x8FC7;&amp;#x6784;&amp;#x5EFA;&amp;#x591A;&amp;#x4E2A;&amp;#x4E0D;&amp;#x540C;&amp;#x89D2;&amp;#x5EA6;&amp;#x3001;&amp;#x4E0D;&amp;#x540C;&amp;#x5C3A;&amp;#x5EA6;&amp;#x7684;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x5206;&amp;#x522B;&amp;#x68C0;&amp;#x6D4B;&amp;#x7279;&amp;#x5B9A;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x53D6;&amp;#x5F97;&amp;#x4E86;&amp;#x6BD4;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt;&lt;a href=&quot;#41&quot;&gt;[41]&lt;/a&gt; &amp;#x4E2D;&amp;#x590D;&amp;#x6742;&amp;#x53D8;&amp;#x5F62;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/6.png&quot; alt=&quot; &amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7ED3;&amp;#x679C;&amp;#x793A;&amp;#x4F8B; &quot;&gt; &amp;#x56FE; 2-4 &amp;#x5DE6;&amp;#x56FE;&amp;#x4E3A;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt; &amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#x3002; &amp;#x53F3;&amp;#x56FE;&amp;#x4E3A;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#40&quot;&gt;[40]&lt;/a&gt; &amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#xFF0C; &amp;#x7EA2;&amp;#x8272;&amp;#x4E3A;&amp;#x906E;&amp;#x6321;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x5668;&amp;#x8BA1;&amp;#x7B97;&amp;#x91CF;&amp;#x5927;&amp;#xFF0C; &amp;#x4E3B;&amp;#x8981;&amp;#x7531;&amp;#x4E8E;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x5BF9;&amp;#x4E8E;&amp;#x6BCF;&amp;#x4E2A;&amp;#x5019;&amp;#x9009;&amp;#x7A97;&amp;#x53E3;&amp;#x90FD;&amp;#x9700;&amp;#x8981;&amp;#x6267;&amp;#x884C; Latent SVM &amp;#x6765;&amp;#x5BFB;&amp;#x627E;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#xFF1B;&lt;/li&gt;
&lt;li&gt;&amp;#x4E3A;&amp;#x4E86;&amp;#x53EF;&amp;#x4EE5;&amp;#x5904;&amp;#x7406;&amp;#x4E0D;&amp;#x540C;&amp;#x89D2;&amp;#x5EA6;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x8BAD;&amp;#x7EC3;&amp;#x591A;&amp;#x4E2A;&amp;#x6A21;&amp;#x578B;&amp;#x5206;&amp;#x522B;&amp;#x8FDB;&amp;#x884C;&amp;#x5904;&amp;#x7406; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt;&lt;a href=&quot;#28&quot;&gt;[28]&lt;/a&gt;&lt;a href=&quot;#40&quot;&gt;[40]&lt;/a&gt;&lt;a href=&quot;#41&quot;&gt;[41]&lt;/a&gt;&lt;a href=&quot;#42&quot;&gt;[42]&lt;/a&gt;&amp;#x3002; &lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x53E6;&amp;#x5916;&amp;#xFF0C; &amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x7B97;&amp;#x6CD5; &lt;a href=&quot;#9&quot;&gt;[9]&lt;/a&gt;&lt;a href=&quot;#40&quot;&gt;[40]&lt;/a&gt; &amp;#x9700;&amp;#x8981;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5305;&amp;#x542B;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x70B9;&amp;#x7684;&amp;#x6807;&amp;#x5B9A;&amp;#xFF0C; &amp;#x5EFA;&amp;#x7ACB;&amp;#x8FD9;&amp;#x4E9B;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x9700;&amp;#x8981;&amp;#x6D88;&amp;#x8017;&amp;#x5927;&amp;#x91CF;&amp;#x4EBA;&amp;#x529B;&amp;#x7269;&amp;#x529B;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;a href=&quot;#&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;/a&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&lt;/h2&gt;&lt;h3 id=&quot;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&quot;&gt;&lt;a href=&quot;#&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&quot;&gt;&lt;/a&gt;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&lt;/h3&gt;&lt;p&gt;&amp;#x4F20;&amp;#x7EDF;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x9700;&amp;#x8981;&amp;#x4EBA;&amp;#x5DE5;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#xFF0C; &amp;#x9700;&amp;#x8981;&amp;#x5927;&amp;#x91CF;&amp;#x4E13;&amp;#x4E1A;&amp;#x9886;&amp;#x57DF;&amp;#x77E5;&amp;#x8BC6;&amp;#xFF0C; &amp;#x7EBF;&amp;#x6027;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x5BF9;&amp;#x4EBA;&amp;#x5DE5;&amp;#x63D0;&amp;#x53D6;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x8FDB;&amp;#x884C;&amp;#x5206;&amp;#x7C7B;&amp;#xFF0C; &amp;#x53EA;&amp;#x80FD;&amp;#x628A;&amp;#x6837;&amp;#x672C;&amp;#x5206;&amp;#x6210;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x533A;&amp;#x57DF;&amp;#x3002; &amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x6838;&amp;#x5FC3;&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x4F7F;&amp;#x7528;&amp;#x81EA;&amp;#x4E3B;&amp;#x5B66;&amp;#x4E60;&amp;#x8FC7;&amp;#x7A0B;&amp;#x6765;&amp;#x5F97;&amp;#x5230;&amp;#x826F;&amp;#x597D;&amp;#x7684;&amp;#x7279;&amp;#x5F81; &lt;a href=&quot;#43&quot;&gt;[43]&lt;/a&gt;&amp;#x3002; &amp;#x7531;&amp;#x4E8E;&amp;#x68AF;&amp;#x5EA6;&amp;#x4E0B;&amp;#x964D;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EF;&amp;#x80FD;&amp;#x4F7F;&amp;#x5F97;&amp;#x7F51;&amp;#x7EDC;&amp;#x9677;&amp;#x5165;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;&amp;#xFF0C; &amp;#x5728; 20 &amp;#x4E16;&amp;#x7EAA; 90 &amp;#x5E74;&amp;#x4EE3;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x65B9;&amp;#x6CD5;&amp;#x88AB;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x6240;&amp;#x629B;&amp;#x5F03;&amp;#x3002; &amp;#x8FD1;&amp;#x5E74;&amp;#x6765;&amp;#xFF0C;&amp;#x968F;&amp;#x7740;&amp;#x7406;&amp;#x8BBA;&amp;#x7814;&amp;#x7A76;&amp;#x53CA;&amp;#x5B9E;&amp;#x8DF5;&amp;#x8868;&amp;#x660E;&amp;#xFF0C; &amp;#x5927;&amp;#x7F51;&amp;#x7EDC;&amp;#x603B;&amp;#x662F;&amp;#x4F1A;&amp;#x5F97;&amp;#x5230;&amp;#x5DEE;&amp;#x4E0D;&amp;#x591A;&amp;#x7684;&amp;#x89E3;&amp;#xFF0C; &amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x503C;&amp;#x5E76;&amp;#x4E0D;&amp;#x4F1A;&amp;#x5BF9;&amp;#x7F51;&amp;#x7EDC;&amp;#x6574;&amp;#x4F53;&amp;#x6027;&amp;#x80FD;&amp;#x9020;&amp;#x6210;&amp;#x5F88;&amp;#x5927;&amp;#x5F71;&amp;#x54CD; &lt;a href=&quot;#20&quot;&gt;[20]&lt;/a&gt;&amp;#x3002; &amp;#x540C;&amp;#x65F6;&amp;#xFF0C; ReLU &amp;#x975E;&amp;#x7EBF;&amp;#x6027;&amp;#x51FD;&amp;#x6570; &lt;a href=&quot;#44&quot;&gt;[44]&lt;/a&gt; &amp;#x7684;&amp;#x63D0;&amp;#x51FA;&amp;#x89E3;&amp;#x51B3;&amp;#x4E86;&amp;#x68AF;&amp;#x5EA6;&amp;#x5F25;&amp;#x6563;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C; dropout &amp;#x601D;&amp;#x60F3; &lt;a href=&quot;#45&quot;&gt;[45]&lt;/a&gt; &amp;#x7684;&amp;#x63D0;&amp;#x51FA;&amp;#x4E00;&amp;#x5B9A;&amp;#x7A0B;&amp;#x5EA6;&amp;#x4E0A;&amp;#x89E3;&amp;#x51B3;&amp;#x4E86;&amp;#x7F51;&amp;#x7EDC;&amp;#x8FC7;&amp;#x62DF;&amp;#x5408;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C; &amp;#x9884;&amp;#x8BAD;&amp;#x7EC3; (pre-trained) &amp;#x8FC7;&amp;#x7A0B;&amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x5F97;&amp;#x7F51;&amp;#x7EDC;&amp;#x8BAD;&amp;#x7EC3;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x53D1;&amp;#x73B0; &lt;a href=&quot;#43&quot;&gt;[43]&lt;/a&gt;&amp;#xFF0C; &amp;#x4F7F;&amp;#x5F97;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5B66;&amp;#x4E60;&amp;#x7B97;&amp;#x6CD5;&amp;#x91CD;&amp;#x65B0;&amp;#x88AB;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x5173;&amp;#x6CE8;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x91CD;&amp;#x65B0;&amp;#x88AB;&amp;#x8BA1;&amp;#x7B97;&amp;#x673A;&amp;#x89C6;&amp;#x89C9;&amp;#x56E2;&amp;#x961F;&amp;#x53CA;&amp;#x7814;&amp;#x7A76;&amp;#x8005;&amp;#x4EEC;&amp;#x6240;&amp;#x91CD;&amp;#x89C6;&amp;#x662F;&amp;#x5728; 2012 &amp;#x5E74;&amp;#x7684;&amp;#x767E;&amp;#x4E07;&amp;#x56FE;&amp;#x50CF;&amp;#x89C4;&amp;#x6A21;&amp;#x6570;&amp;#x636E;&amp;#x7ADE;&amp;#x8D5B; ImageNet &amp;#x540E;&amp;#xFF0C; &amp;#x8BE5;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5305;&amp;#x542B; $ 1000 $ &amp;#x4E2A;&amp;#x7C7B;&amp;#x522B;&amp;#x7684;&amp;#x7269;&amp;#x4F53;&amp;#xFF0C; &amp;#x6DF1;&amp;#x5EA6;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7B97;&amp;#x6CD5;&amp;#x51E0;&amp;#x4E4E;&amp;#x6BD4;&amp;#x5F53;&amp;#x65F6;&amp;#x5176;&amp;#x4ED6;&amp;#x65B9;&amp;#x6CD5;&amp;#x964D;&amp;#x4F4E;&amp;#x4E86; $ 50\% $ &amp;#x7684;&amp;#x9519;&amp;#x8BEF;&amp;#x7387; &lt;a href=&quot;#43&quot;&gt;[43]&lt;/a&gt;&amp;#x3002; &amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x88AB;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6210;&amp;#x66F4;&amp;#x5BB9;&amp;#x6613;&amp;#x5730;&amp;#x5904;&amp;#x7406;&amp;#x56FE;&amp;#x50CF;&amp;#x7B49;&amp;#x591A;&amp;#x7EF4;&amp;#x6570;&amp;#x636E;&amp;#xFF0C; &amp;#x5176;&amp;#x4E3B;&amp;#x8981;&amp;#x5305;&amp;#x542B;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x3001;&amp;#x5F52;&amp;#x4E00;&amp;#x5316;&amp;#x5C42;&amp;#x3001;pooling&amp;#x5C42;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/7.png&quot; alt=&quot; &amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x793A;&amp;#x4F8B; &quot;&gt; &amp;#x56FE;2-5 &amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x793A;&amp;#x4F8B;&amp;#xFF0C; &amp;#x5176;&amp;#x4E2D;&amp;#xFF0C; $ f_1, f_2, f_3 $&amp;#x4E3A;&amp;#x524D;&amp;#x4E00;&amp;#x5C42;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#xFF0C;$ h_1, h_2 $ &amp;#x4E3A;&amp;#x4E0B;&amp;#x4E00;&amp;#x5C42;&amp;#x8F93;&amp;#x51FA;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x56FE;&amp;#x50CF;&amp;#x50CF;&amp;#x7D20;&amp;#x76F8;&amp;#x90BB;&amp;#x4F4D;&amp;#x7F6E;&amp;#x5177;&amp;#x6709;&amp;#x5F88;&amp;#x5F3A;&amp;#x7684;&amp;#x76F8;&amp;#x5173;&amp;#x6027;&amp;#xFF0C; &amp;#x5BF9;&amp;#x8FD9;&amp;#x4E9B;&amp;#x4F4D;&amp;#x7F6E;&amp;#x63D0;&amp;#x53D6;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#x66F4;&amp;#x5F3A;&amp;#xFF0C; &amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4F7F;&amp;#x7528;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x5B9E;&amp;#x73B0;&amp;#x8FD9;&amp;#x4E00;&amp;#x529F;&amp;#x80FD;&amp;#xFF0C; &amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x5982;&amp;#x56FE; 2-5 &amp;#x6240;&amp;#x793A;&amp;#x3002; &amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x5305;&amp;#x542B;&amp;#x4E00;&amp;#x7EC4;&amp;#x5377;&amp;#x79EF;&amp;#x6838;&amp;#xFF0C; &amp;#x6BCF;&amp;#x4E2A;&amp;#x5377;&amp;#x79EF;&amp;#x6838;&amp;#x4F5C;&amp;#x7528;&amp;#x4E8E;&amp;#x524D;&amp;#x4E00;&amp;#x5C42;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x4E0A;&amp;#xFF0C; &amp;#x4E0A;&amp;#x4E00;&amp;#x5C42;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x7684;&amp;#x52A0;&amp;#x6743;&amp;#x548C;&amp;#x5F97;&amp;#x5230;&amp;#x4E0B;&amp;#x4E00;&amp;#x5C42;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#xFF0C; &amp;#x5377;&amp;#x79EF;&amp;#x6838;&amp;#x7C7B;&amp;#x4F3C;&amp;#x6EE4;&amp;#x6CE2;&amp;#x64CD;&amp;#x4F5C;&amp;#x3002; &amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x5C40;&amp;#x90E8;&amp;#x8FDE;&amp;#x63A5;&amp;#xFF0C; &amp;#x5927;&amp;#x5927;&amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x5168;&amp;#x8FDE;&amp;#x63A5; (fully connected) &amp;#x5C42;&amp;#x7684;&amp;#x53C2;&amp;#x6570;&amp;#x6570;&amp;#x76EE;&amp;#x3002; &amp;#x5229;&amp;#x7528; ReLU &amp;#x4F5C;&amp;#x4E3A;&amp;#x6FC0;&amp;#x6D3B;&amp;#x51FD;&amp;#x6570;&amp;#xFF0C; &amp;#x5219;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x8F93;&amp;#x51FA;&amp;#x4E3A;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;$$ h_i = max(0, \sum_k f_k*w_i ) $$&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4E2D;&amp;#x4E3A; $ w_i $ &amp;#x5F53;&amp;#x524D;&amp;#x5C42;&amp;#x7B2C; $ i $ &amp;#x4E2A;&amp;#x5377;&amp;#x79EF;&amp;#x6838;&amp;#xFF0C; $ f_k $ &amp;#x4E3A;&amp;#x524D;&amp;#x4E00;&amp;#x5C42;&amp;#x7B2C; $ k $ &amp;#x4E2A;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#xFF0C;$ h_i $&amp;#x4E3A;&amp;#x5F53;&amp;#x524D;&amp;#x5C42;&amp;#x7B2C; $ i $ &amp;#x4E2A;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x8F93;&amp;#x51FA;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5F52;&amp;#x4E00;&amp;#x5316;&amp;#x5C42;&amp;#x5F80;&amp;#x5F80;&amp;#x63A5;&amp;#x5728;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x540E;&amp;#xFF0C; &amp;#x662F;&amp;#x5BF9;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x5F97;&amp;#x5230;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x7684;&amp;#x5F52;&amp;#x4E00;&amp;#x5316;&amp;#xFF0C; &amp;#x53BB;&amp;#x9664;&amp;#x5149;&amp;#x7167;&amp;#x3001;&amp;#x7EBF;&amp;#x6027;&amp;#x566A;&amp;#x58F0;&amp;#x7B49;&amp;#x5916;&amp;#x754C;&amp;#x56E0;&amp;#x7D20;&amp;#x7684;&amp;#x5F71;&amp;#x54CD;&amp;#xFF0C; &amp;#x589E;&amp;#x5F3A;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x7684;&amp;#x9002;&amp;#x5E94;&amp;#x6027;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;Pooling &amp;#x5C42;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x8BA9;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x63D0;&amp;#x53D6;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x66F4;&amp;#x52A0;&amp;#x9C81;&amp;#x68D2;&amp;#x3002; &amp;#x8BE5;&amp;#x5C42;&amp;#x8BA1;&amp;#x7B97;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x5C0F;&amp;#x90BB;&amp;#x57DF;&amp;#x7684;&amp;#x6700;&amp;#x5927;&amp;#x503C; (max-pooling) &amp;#x6216;&amp;#x8005;&amp;#x5E73;&amp;#x5747;&amp;#x503C; (avg-pooling)&amp;#xFF0C; &amp;#x4E00;&amp;#x65B9;&amp;#x9762;&amp;#x5BF9;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x5F97;&amp;#x5230;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x8FDB;&amp;#x884C;&amp;#x4E86;&amp;#x964D;&amp;#x7EF4;&amp;#xFF0C; &amp;#x53E6;&amp;#x4E00;&amp;#x65B9;&amp;#x9762;&amp;#x51CF;&amp;#x5C11;&amp;#x4E86;&amp;#x566A;&amp;#x58F0;&amp;#x5E72;&amp;#x6270;&amp;#xFF0C; &amp;#x4F7F;&amp;#x5F97;&amp;#x7279;&amp;#x5F81;&amp;#x66F4;&amp;#x52A0;&amp;#x7A81;&amp;#x51FA;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;-1&quot;&gt;&lt;a href=&quot;#&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;-&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;-1&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&quot;&gt;&lt;/a&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&lt;/h3&gt;&lt;p&gt;&amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x5386;&amp;#x53F2;&amp;#x60A0;&amp;#x4E45; &lt;a href=&quot;#46&quot;&gt;[46]&lt;/a&gt;-&lt;a href=&quot;#53&quot;&gt;[53]&lt;/a&gt;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#46&quot;&gt;[46]&lt;/a&gt;&lt;a href=&quot;#47&quot;&gt;[47]&lt;/a&gt; &amp;#x57FA;&amp;#x4E8E;&amp;#x6D45;&amp;#x5C42;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x8BAD;&amp;#x7EC3;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E24;&amp;#x9636;&amp;#x6BB5;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7CFB;&amp;#x7EDF;&amp;#xFF0C; &amp;#x5728;&amp;#x7B2C;&amp;#x4E00;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C; &amp;#x8BAD;&amp;#x7EC3;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x7F51;&amp;#x7EDC;&amp;#x7C97;&amp;#x7565;&amp;#x5B9A;&amp;#x4F4D;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C; &amp;#x7B2C;&amp;#x4E8C;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#x5219;&amp;#x4F7F;&amp;#x7528;&amp;#x53E6;&amp;#x5916;&amp;#x4E00;&amp;#x4E2A;&amp;#x7F51;&amp;#x7EDC;&amp;#x6765;&amp;#x9A8C;&amp;#x8BC1;&amp;#x8FD9;&amp;#x4E9B;&amp;#x4F4D;&amp;#x7F6E;&amp;#x662F;&amp;#x5426;&amp;#x5305;&amp;#x542B;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x5E76;&amp;#x8C03;&amp;#x6574;&amp;#x4E86;&amp;#x68C0;&amp;#x6D4B;&amp;#x6846;&amp;#x3002; &amp;#x5355;&amp;#x4E2A;&amp;#x7F51;&amp;#x7EDC;&amp;#x53EF;&amp;#x80FD;&amp;#x5F97;&amp;#x5230;&amp;#x5C40;&amp;#x90E8;&amp;#x6700;&amp;#x4F18;&amp;#x503C;&amp;#xFF0C; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#48&quot;&gt;[48]&lt;/a&gt; &amp;#x5728;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x4E0A;&amp;#x5206;&amp;#x522B;&amp;#x91C7;&amp;#x7528;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x968F;&amp;#x673A;&amp;#x521D;&amp;#x59CB;&amp;#x5316;&amp;#x53C2;&amp;#x6570;&amp;#x8BAD;&amp;#x7EC3;&amp;#x4E86;&amp;#x82E5;&amp;#x5E72;&amp;#x4E2A;&amp;#x6D45;&amp;#x5C42;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C; &amp;#x4EE5;&amp;#x6B64;&amp;#x6765;&amp;#x907F;&amp;#x514D;&amp;#x8BE5;&amp;#x95EE;&amp;#x9898;&amp;#x3002; &amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#x56FE;&amp;#x50CF;&amp;#x88AB;&amp;#x7F29;&amp;#x653E;&amp;#x5230;&amp;#x591A;&amp;#x4E2A;&amp;#x5C3A;&amp;#x5EA6;&amp;#x4E0A;&amp;#xFF0C; &amp;#x6BCF;&amp;#x4E2A;&amp;#x7F51;&amp;#x7EDC;&amp;#x5BF9;&amp;#x56FE;&amp;#x50CF;&amp;#x8F93;&amp;#x51FA;&amp;#x4EBA;&amp;#x8138;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C; &amp;#x6765;&amp;#x81EA;&amp;#x8FD9;&amp;#x4E9B;&amp;#x6D45;&amp;#x5C42;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#x7ECF;&amp;#x8FC7;&amp;#x4E00;&amp;#x7CFB;&amp;#x5217;&amp;#x7684;&amp;#x6B65;&amp;#x9AA4;&amp;#x8FDB;&amp;#x884C;&amp;#x878D;&amp;#x5408;&amp;#xFF0C; &amp;#x5F97;&amp;#x5230;&amp;#x4E86;&amp;#x6BD4;&amp;#x5355;&amp;#x4E2A;&amp;#x7F51;&amp;#x7EDC;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x7ED3;&amp;#x679C;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/8.png&quot; alt=&quot; DDFD&amp;#x793A;&amp;#x4F8B; &quot;&gt; &amp;#x56FE;2-6 &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#13&quot;&gt;[13]&lt;/a&gt; &amp;#x7F51;&amp;#x7EDC;&amp;#x8F93;&amp;#x51FA;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x6982;&amp;#x7387;&amp;#x5206;&amp;#x5E03;&amp;#x56FE;&amp;#x793A;&amp;#x4F8B;&amp;#x3002; &amp;#x5DE6;&amp;#x56FE;&amp;#x4E3A;&amp;#x539F;&amp;#x56FE;, &amp;#x53F3;&amp;#x56FE;&amp;#x4E3A;&amp;#x5176;&amp;#x6982;&amp;#x7387;&amp;#x5206;&amp;#x5E03;&amp;#x56FE;, &amp;#x7EA2;&amp;#x8272;&amp;#x533A;&amp;#x57DF;&amp;#x8868;&amp;#x793A;&amp;#x4EBA;&amp;#x8138;&amp;#x51FA;&amp;#x73B0;&amp;#x6982;&amp;#x7387;&amp;#x9AD8;&amp;#x7684;&amp;#x533A;&amp;#x57DF;, &amp;#x84DD;&amp;#x8272;&amp;#x5219;&amp;#x8868;&amp;#x793A;&amp;#x4EBA;&amp;#x8138;&amp;#x51FA;&amp;#x73B0;&amp;#x6982;&amp;#x7387;&amp;#x4F4E;&amp;#x7684;&amp;#x533A;&amp;#x57DF;&amp;#xFF08;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x7F51;&amp;#x7AD9;&lt;a href=&quot;https://github.com/guoyilin/FaceDetection_CNN&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;https://github.com/guoyilin/FaceDetection_CNN&lt;/a&gt; &amp;#x7684;&amp;#x6A21;&amp;#x578B;&amp;#xFF09;&amp;#x3002;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x66F4;&amp;#x6DF1;&amp;#x7684;&amp;#x7F51;&amp;#x7EDC;&amp;#x62E5;&amp;#x6709;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x6027;&amp;#x80FD;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#49&quot;&gt;[49]&lt;/a&gt; &amp;#x8BAD;&amp;#x7EC3;&amp;#x4E86;&amp;#x5355;&amp;#x4E2A;&amp;#x6D45;&amp;#x5C42;&amp;#x5377;&amp;#x79EF;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x6765;&amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#xFF0C; &amp;#x8BE5;&amp;#x7F51;&amp;#x7EDC;&amp;#x5305;&amp;#x542B;&amp;#x4E24;&amp;#x5C42;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x4E0E; Pooling &amp;#x5C42;&amp;#xFF0C; &amp;#x5E76;&amp;#x901A;&amp;#x8FC7;&amp;#x6743;&amp;#x91CD;&amp;#x5171;&amp;#x4EAB;&amp;#x5C06;&amp;#x7F51;&amp;#x7EDC;&amp;#x53C2;&amp;#x6570;&amp;#x51CF;&amp;#x5C11;&amp;#x3002; &amp;#x4E0E;&amp;#x8FC7;&amp;#x53BB;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EA;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x5C0F;&amp;#x8303;&amp;#x56F4;&amp;#x65CB;&amp;#x8F6C;&amp;#x5EA6;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x96C6;&amp;#x6269;&amp;#x5145;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C; &amp;#x5728;&amp;#x8BAD;&amp;#x7EC3;&amp;#x65F6;&amp;#xFF0C; &amp;#x8BE5;&amp;#x7B97;&amp;#x6CD5;&amp;#x5C06;&amp;#x4EBA;&amp;#x8138;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x5DE6;&amp;#x53F3;&amp;#x65CB;&amp;#x8F6C;&amp;#x5EA6;&amp;#x53CA;&amp;#x4EAE;&amp;#x5EA6;&amp;#x5F52;&amp;#x4E00;&amp;#x5316;&amp;#x5904;&amp;#x7406;&amp;#x5F97;&amp;#x5230;&amp;#x66F4;&amp;#x591A;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6837;&amp;#x672C;&amp;#xFF0C; &amp;#x4F7F;&amp;#x5F97;&amp;#x7F51;&amp;#x7EDC;&amp;#x66F4;&amp;#x52A0;&amp;#x9002;&amp;#x5E94;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x65CB;&amp;#x8F6C;&amp;#x548C;&amp;#x4EAE;&amp;#x5EA6;&amp;#x53D8;&amp;#x5316;&amp;#x3002; &amp;#x6587;&amp;#x732E; &lt;a href=&quot;#53&quot;&gt;[53]&lt;/a&gt; &amp;#x4E0E;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#49&quot;&gt;[49]&lt;/a&gt; &amp;#x4E00;&amp;#x6837;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x548C; Pooling &amp;#x5C42;&amp;#xFF0C; &amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x662F;&amp;#x521B;&amp;#x9020;&amp;#x6027;&amp;#x5728;&amp;#x6D45;&amp;#x5C42;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x91CC;&amp;#x5F15;&amp;#x5165;&amp;#x4E86;&amp;#x591A;&amp;#x4EFB;&amp;#x52A1;&amp;#x635F;&amp;#x5931;&amp;#x51FD;&amp;#x6570;&amp;#x8FDB;&amp;#x884C;&amp;#x5B66;&amp;#x4E60;&amp;#xFF0C; &amp;#x8BE5;&amp;#x51FD;&amp;#x6570;&amp;#x5305;&amp;#x542B;&amp;#x4E86;&amp;#x4E24;&amp;#x90E8;&amp;#x5206;&amp;#xFF0C; &amp;#x4E00;&amp;#x90E8;&amp;#x5206;&amp;#x4E3A;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7684;&amp;#x635F;&amp;#x5931;&amp;#x51FD;&amp;#x6570;&amp;#xFF0C; &amp;#x7B2C;&amp;#x4E8C;&amp;#x90E8;&amp;#x5206;&amp;#x662F;&amp;#x4EBA;&amp;#x8138;&amp;#x89D2;&amp;#x5EA6;&amp;#x9884;&amp;#x6D4B;&amp;#x7684;&amp;#x635F;&amp;#x5931;&amp;#x51FD;&amp;#x6570;&amp;#x3002; &amp;#x901A;&amp;#x8FC7;&amp;#x8FD9;&amp;#x79CD;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF0C; &amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x4E0D;&amp;#x4EC5;&amp;#x80FD;&amp;#x68C0;&amp;#x6D4B;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#xFF0C; &amp;#x8FD8;&amp;#x80FD;&amp;#x9884;&amp;#x6D4B;&amp;#x51FA;&amp;#x4EBA;&amp;#x8138;&amp;#x6240;&amp;#x5728;&amp;#x7684;&amp;#x89D2;&amp;#x5EA6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x968F;&amp;#x7740;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x91CD;&amp;#x65B0;&amp;#x5174;&amp;#x8D77;&amp;#x53CA; GPU &amp;#x786C;&amp;#x4EF6;&amp;#x7684;&amp;#x652F;&amp;#x6301;&amp;#xFF0C; &amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6240;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x7F51;&amp;#x7EDC;&amp;#x6CBF;&amp;#x7740;&amp;#x66F4;&amp;#x6DF1;&amp;#x66F4;&amp;#x5E7F;&amp;#x7684;&amp;#x8D8B;&amp;#x52BF;&amp;#x53D1;&amp;#x5C55;&amp;#x3002; &amp;#x6587;&amp;#x732E;&lt;a href=&quot;#13&quot;&gt;[13]&lt;/a&gt; &amp;#x5728;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#49&quot;&gt;[49]&lt;/a&gt; &amp;#x7684;&amp;#x57FA;&amp;#x7840;&amp;#x4E0A;&amp;#xFF0C; &amp;#x4F7F;&amp;#x7528; GPU &amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x5B66;&amp;#x4E60;&amp;#x4E86;&amp;#x66F4;&amp;#x6DF1;&amp;#x7684;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC; AlexNet &lt;a href=&quot;#12&quot;&gt;[12]&lt;/a&gt;&lt;a href=&quot;#14&quot;&gt;[14]&lt;/a&gt;&amp;#xFF0C; &amp;#x5176;&amp;#x7F51;&amp;#x7EDC;&amp;#x62E5;&amp;#x6709;&amp;#x4E94;&amp;#x5C42;&amp;#x5377;&amp;#x79EF;&amp;#x5C42;&amp;#x548C;&amp;#x4E24;&amp;#x5C42; Pooling &amp;#x5C42;&amp;#x3002; &amp;#x4E0E;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#49&quot;&gt;[49]&lt;/a&gt; &amp;#x76F8;&amp;#x6BD4;&amp;#xFF0C; &amp;#x6700;&amp;#x5927;&amp;#x4E0D;&amp;#x540C;&amp;#x5728;&amp;#x4E8E;:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x7F51;&amp;#x7EDC;&amp;#x66F4;&amp;#x6DF1;&amp;#x66F4;&amp;#x5E7F;&amp;#xFF0C; &amp;#x4F7F;&amp;#x7528;&amp;#x4E86; ReLU &amp;#x975E;&amp;#x7EBF;&amp;#x6027;&amp;#x51FD;&amp;#x6570;&amp;#x3001;dropout &amp;#x51FD;&amp;#x6570;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#xFF1B;&lt;/li&gt;
&lt;li&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x5728;&amp;#x8D85;&amp;#x5927;&amp;#x578B; ImageNet &amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x4E0A;&amp;#x9884;&amp;#x8BAD;&amp;#x7EC3;&amp;#x597D;&amp;#x7684;&amp;#x6A21;&amp;#x578B; AlexNet&amp;#xFF0C; &amp;#x5176;&amp;#x6A21;&amp;#x578B;&amp;#x672C;&amp;#x8EAB;&amp;#x521D;&amp;#x59CB;&amp;#x5316;&amp;#x7684;&amp;#x6743;&amp;#x503C;&amp;#x62E5;&amp;#x6709;&amp;#x610F;&amp;#x4E49;&amp;#xFF1B;&lt;/li&gt;
&lt;li&gt;&amp;#x4FEE;&amp;#x6539;&amp;#x4E86;&amp;#x5168;&amp;#x8FDE;&amp;#x63A5;&amp;#x5C42;&amp;#x4F7F;&amp;#x5176;&amp;#x53EF;&amp;#x4EE5;&amp;#x8F93;&amp;#x51FA;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4F4D;&amp;#x7F6E;&amp;#x4E0A;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x54CD;&amp;#x5E94;&amp;#xFF0C; &amp;#x901A;&amp;#x8FC7;&amp;#x626B;&amp;#x63CF;&amp;#x7A97;&amp;#x53E3;&amp;#x5F97;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x7ED3;&amp;#x679C;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-6 &amp;#x6240;&amp;#x793A;&amp;#xFF1B;&lt;/li&gt;
&lt;li&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x4E86;&amp;#x66F4;&amp;#x5927;&amp;#x7684;&amp;#x6570;&amp;#x636E;&amp;#x96C6;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#xFF0C; &amp;#x968F;&amp;#x673A;&amp;#x91C7;&amp;#x6837;&amp;#x4E86; 200&amp;#xFF0C;000 &amp;#x5F20;&amp;#x4EBA;&amp;#x8138;&amp;#x53CA; 20&amp;#xFF0C;000&amp;#xFF0C;000 &amp;#x4E2A;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#xFF0C; &amp;#x5E76;&amp;#x4E3A;&amp;#x4E86;&amp;#x4FDD;&amp;#x6301;&amp;#x8BAD;&amp;#x7EC3;&amp;#x6570;&amp;#x636E;&amp;#x5747;&amp;#x5300;&amp;#xFF0C; &amp;#x6BCF;&amp;#x6279; (batch) &amp;#x4F7F;&amp;#x7528; 32 &amp;#x4E2A;&amp;#x6B63;&amp;#x6837;&amp;#x672C;&amp;#x53CA; 96 &amp;#x4E2A;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x8FDB;&amp;#x884C;&amp;#x8BAD;&amp;#x7EC3;&amp;#x3002; &lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#13&quot;&gt;[13]&lt;/a&gt; &amp;#x4F7F;&amp;#x7528;&amp;#x5355;&amp;#x4E00;&amp;#x6A21;&amp;#x578B;&amp;#x53D6;&amp;#x5F97;&amp;#x4E86;&amp;#x4E0E;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x548C;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x76F8;&amp;#x4F3C;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x6548;&amp;#x679C;&amp;#x3002; &amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#x5728;&amp;#x4EBA;&amp;#x8138;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x9762;&amp;#x6709;&amp;#x6BD4; HOG&amp;#xFF0C; SURF &amp;#x7B49;&amp;#x7279;&amp;#x5F81;&amp;#x66F4;&amp;#x5F3A;&amp;#x7684;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#xFF0C; &amp;#x6DF1;&amp;#x5EA6;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5B66;&amp;#x4E60;&amp;#x5230;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x662F;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x9AD8;&amp;#x5C42;&amp;#x6B21;&amp;#x7684;&amp;#x62BD;&amp;#x8C61;&amp;#x8868;&amp;#x793A;&amp;#xFF0C; &amp;#x800C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F; (&amp;#x5982;&amp;#x56FE; 2-7) &amp;#x4F7F;&amp;#x5F97;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x6743;&amp;#x91CD;&amp;#x80FD;&amp;#x5B66;&amp;#x4E60;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x6709;&amp;#x663E;&amp;#x8457;&amp;#x7279;&amp;#x5F81;&amp;#x7684;&amp;#x90E8;&amp;#x4F4D;&amp;#xFF0C; &amp;#x5373;&amp;#x80FD;&amp;#x63D0;&amp;#x53D6;&amp;#x5230;&amp;#x5C40;&amp;#x90E8;&amp;#x7279;&amp;#x5F81;&amp;#x3002; &amp;#x6587;&amp;#x732E;&lt;a href=&quot;#54&quot;&gt;[54]&lt;/a&gt; &amp;#x8FDB;&amp;#x4E00;&amp;#x6B65;&amp;#x6269;&amp;#x5C55;&amp;#x4E86;&amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#x4E3A;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x5B66;&amp;#x4E60;&amp;#x5230;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#xFF0C; &amp;#x5B9E;&amp;#x9A8C;&amp;#x8868;&amp;#x660E;&amp;#xFF0C; &amp;#x8FD9;&amp;#x4E9B;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#x6BD4;&amp;#x591A;&amp;#x901A;&amp;#x9053;&amp;#x7279;&amp;#x5F81;&amp;#x6709;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x8868;&amp;#x8FBE;&amp;#x6027;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/9.png&quot; alt=&quot; &amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F; &quot;&gt;&amp;#x56FE; 2-7 &amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;p&gt;&amp;#x9075;&amp;#x5FAA; coarse-to-fine &amp;#x539F;&amp;#x5219;&amp;#x662F;&amp;#x5F53;&amp;#x524D;&amp;#x57FA;&amp;#x4E8E;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x91CD;&amp;#x8981;&amp;#x53D1;&amp;#x5C55;&amp;#x8D8B;&amp;#x52BF;&amp;#x3002; &amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5; &lt;a href=&quot;#39&quot;&gt;[39]&lt;/a&gt; &amp;#x5728;&amp;#x68C0;&amp;#x6D4B;&amp;#x4EBA;&amp;#x8138;&amp;#x540C;&amp;#x65F6;&amp;#x8FDB;&amp;#x884C;&amp;#x4EBA;&amp;#x8138;&amp;#x6807;&amp;#x5B9A;&amp;#x70B9;&amp;#x62DF;&amp;#x5408;&amp;#x6765;&amp;#x53D6;&amp;#x5F97;&amp;#x66F4;&amp;#x597D;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x6846;&amp;#x4F4D;&amp;#x7F6E;&amp;#xFF0C; &amp;#x6587;&amp;#x732E;&lt;a href=&quot;#55&quot;&gt;[55]&lt;/a&gt; &amp;#x5219;&amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x5377;&amp;#x79EF;&amp;#x7F51;&amp;#x7EDC;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002; &amp;#x8BE5;&amp;#x7B97;&amp;#x6CD5;&amp;#x540C;&amp;#x6837;&amp;#x5728;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x4EBA;&amp;#x8138;&amp;#x77EB;&amp;#x6B63;&amp;#x4EE5;&amp;#x83B7;&amp;#x5F97;&amp;#x66F4;&amp;#x9AD8;&amp;#x6027;&amp;#x80FD;&amp;#xFF0C; &amp;#x5171;&amp;#x6709;&amp;#x4E09;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x6BCF;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#x5747;&amp;#x5305;&amp;#x542B;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x7F51;&amp;#x7EDC;&amp;#xFF0C; &amp;#x540E;&amp;#x4E00;&amp;#x9636;&amp;#x6BB5;&amp;#x6BD4;&amp;#x524D;&amp;#x4E00;&amp;#x9636;&amp;#x6BB5;&amp;#x7F51;&amp;#x7EDC;&amp;#x8981;&amp;#x66F4;&amp;#x5927;&amp;#xFF0C; &amp;#x5206;&amp;#x7C7B;&amp;#x6027;&amp;#x80FD;&amp;#x66F4;&amp;#x5F3A;&amp;#x3002; &amp;#x6BCF;&amp;#x4E2A;&amp;#x9636;&amp;#x6BB5;&amp;#x7684;&amp;#x7F51;&amp;#x7EDC;&amp;#x8F93;&amp;#x51FA;&amp;#x4F1A;&amp;#x7ECF;&amp;#x8FC7;&amp;#x5C3A;&amp;#x5EA6;&amp;#x3001;&amp;#x957F;&amp;#x5BBD;&amp;#x3001;&amp;#x4F4D;&amp;#x7F6E;&amp;#x8C03;&amp;#x6574;&amp;#x4EA7;&amp;#x751F;&amp;#x82E5;&amp;#x5E72;&amp;#x4E2A;&amp;#x5019;&amp;#x9009;&amp;#x533A;&amp;#x57DF;&amp;#x518D;&amp;#x6B21;&amp;#x8FDB;&amp;#x884C;&amp;#x68C0;&amp;#x6D4B;&amp;#xFF0C; &amp;#x4FDD;&amp;#x7559;&amp;#x5F97;&amp;#x5206;&amp;#x6BD4;&amp;#x8F83;&amp;#x597D;&amp;#x7684;&amp;#x533A;&amp;#x57DF;&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E0B;&amp;#x4E00;&amp;#x9636;&amp;#x6BB5;&amp;#x7684;&amp;#x8F93;&amp;#x5165;&amp;#xFF0C; &amp;#x4EE5;&amp;#x6B64;&amp;#x5C06;&amp;#x8FD9;&amp;#x4E9B;&amp;#x533A;&amp;#x57DF;&amp;#x9010;&amp;#x6E10;&amp;#x8C03;&amp;#x6574;&amp;#x5230;&amp;#x66F4;&amp;#x7CBE;&amp;#x786E;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x4F4D;&amp;#x7F6E;&amp;#x4E0A;&amp;#x3002; Yang&amp;#x7B49;&amp;#x4EBA;&lt;a href=&quot;#56&quot;&gt;[56]&lt;/a&gt; &amp;#x91C7;&amp;#x7528;&amp;#x4E0E;&amp;#x6587;&amp;#x732E; &lt;a href=&quot;#46&quot;&gt;[46]&lt;/a&gt; &amp;#x76F8;&amp;#x4F3C;&amp;#x7684;&amp;#x7B56;&amp;#x7565;&amp;#xFF0C; &amp;#x63D0;&amp;#x51FA;&amp;#x4E86;&amp;#x53CC;&amp;#x9636;&amp;#x6BB5;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x5668;&amp;#xFF0C; &amp;#x4F46;&amp;#x6DF1;&amp;#x5EA6;&amp;#x8981;&amp;#x66F4;&amp;#x52A0;&amp;#x6DF1;&amp;#xFF0C; &amp;#x5BF9;&amp;#x6BCF;&amp;#x4E2A;&amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#x751F;&amp;#x6210;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&amp;#x8FC7;&amp;#x6EE4;&amp;#x5F97;&amp;#x5206;&amp;#x8FC7;&amp;#x4F4E;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x5019;&amp;#x9009;&amp;#x533A;&amp;#x57DF;&amp;#xFF0C; &amp;#x5982;&amp;#x56FE; 2-8&amp;#xFF0C; &amp;#x5E76;&amp;#x901A;&amp;#x8FC7;&amp;#x63A5;&amp;#x5728;&amp;#x5176;&amp;#x540E;&amp;#x7684;&amp;#x68C0;&amp;#x6D4B;&amp;#x7F51;&amp;#x7EDC;&amp;#x5F97;&amp;#x5230;&amp;#x5BF9;&amp;#x5019;&amp;#x9009;&amp;#x533A;&amp;#x57DF;&amp;#x8FDB;&amp;#x884C;&amp;#x66F4;&amp;#x52A0;&amp;#x4E25;&amp;#x683C;&amp;#x7684;&amp;#x5206;&amp;#x7C7B;&amp;#x4E0E;&amp;#x8C03;&amp;#x6574;&amp;#x3002;&lt;/p&gt;
&lt;center&gt;&lt;img src=&quot;/2016/06/07/&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x6982;&amp;#x8FF0;/10.png&quot; alt=&quot; &amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F; &quot;&gt; &amp;#x56FE;2-8 &amp;#x4EBA;&amp;#x8138;&amp;#x90E8;&amp;#x4F4D;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&amp;#x3002; &amp;#x5DE6;&amp;#x4E0A;&amp;#x89D2;&amp;#x4E3A;&amp;#x539F;&amp;#x56FE;&amp;#xFF0C;&amp;#x4ECE;&amp;#x5DE6;&amp;#x5230;&amp;#x53F3;&amp;#x4ECE;&amp;#x4E0A;&amp;#x5230;&amp;#x4E0B;&amp;#x5206;&amp;#x522B;&amp;#x4E3A;&amp;#x8BE5;&amp;#x56FE;&amp;#x5934;&amp;#x53D1;&amp;#x3001;&amp;#x773C;&amp;#x775B;&amp;#x3001;&amp;#x9F3B;&amp;#x5B50;&amp;#x3001;&amp;#x5634;&amp;#x5DF4;&amp;#x3001;&amp;#x4E0B;&amp;#x5DF4;&amp;#x7684;&amp;#x54CD;&amp;#x5E94;&amp;#x56FE;&lt;br&gt;&lt;br&gt;&lt;/center&gt;

&lt;h2 id=&quot;&amp;#x5C0F;&amp;#x7ED3;&quot;&gt;&lt;a href=&quot;#&amp;#x5C0F;&amp;#x7ED3;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x5C0F;&amp;#x7ED3;&quot;&gt;&lt;/a&gt;&amp;#x5C0F;&amp;#x7ED3;&lt;/h2&gt;&lt;p&gt;&amp;#x672C;&amp;#x6587;&amp;#x4ECE;&amp;#x4E09;&amp;#x4E2A;&amp;#x5206;&amp;#x652F;&amp;#x4E0A;&amp;#x6982;&amp;#x8FF0;&amp;#x4E86;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x3002;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x8FBE;&amp;#x65B9;&amp;#x9762;&amp;#xFF0C; &amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x53CA;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x68C0;&amp;#x6D4B;&amp;#x7B97;&amp;#x6CD5;&amp;#x591A;&amp;#x662F;&amp;#x4EBA;&amp;#x5DE5;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7684;&amp;#xFF0C; &amp;#x800C;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x5219;&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x7F51;&amp;#x7EDC;&amp;#x5B66;&amp;#x4E60;&amp;#x4EBA;&amp;#x8138;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x56FE;&amp;#xFF0C; &amp;#x5177;&amp;#x6709;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x7279;&amp;#x5F81;&amp;#x8868;&amp;#x793A;&amp;#x65B9;&amp;#x5F0F;&amp;#x3002; &amp;#x5C3D;&amp;#x7BA1;&amp;#x5404;&amp;#x4E2A;&amp;#x5206;&amp;#x652F;&amp;#x7684;&amp;#x5904;&amp;#x7406;&amp;#x65B9;&amp;#x6CD5;&amp;#x4E0D;&amp;#x4E00;&amp;#xFF0C; &amp;#x4F46;&amp;#x53EF;&amp;#x4EE5;&amp;#x770B;&amp;#x5230;&amp;#x8FD9;&amp;#x4E09;&amp;#x7C7B;&amp;#x65B9;&amp;#x6CD5;&amp;#x7684;&amp;#x672C;&amp;#x8D28;&amp;#x90FD;&amp;#x662F;&amp;#x4E00;&amp;#x6837;&amp;#x7684;&amp;#xFF0C; &amp;#x90FD;&amp;#x662F;&amp;#x63D0;&amp;#x53D6;&amp;#x4EBA;&amp;#x8138;&amp;#x7279;&amp;#x5F81;&amp;#x8FDB;&amp;#x884C;&amp;#x5206;&amp;#x7C7B;&amp;#xFF0C; &amp;#x68C0;&amp;#x6D4B;&amp;#x51FA;&amp;#x56FE;&amp;#x50CF;&amp;#x4E2D;&amp;#x6240;&amp;#x6709;&amp;#x4EBA;&amp;#x8138;&amp;#x51FA;&amp;#x73B0;&amp;#x7684;&amp;#x4F4D;&amp;#x7F6E;&amp;#x3002; &amp;#x8FD9;&amp;#x4E09;&amp;#x8005;&amp;#x57FA;&amp;#x672C;&amp;#x7684;&amp;#x4E0D;&amp;#x540C;&amp;#x70B9;&amp;#x5728;&amp;#x4E8E;&amp;#xFF0C; &amp;#x57FA;&amp;#x4E8E;&amp;#x7EA7;&amp;#x8054;&amp;#x7ED3;&amp;#x6784;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x4E86;&amp;#x56FE;&amp;#x50CF;&amp;#x4E2D;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x6570;&amp;#x76EE;&amp;#x5E9E;&amp;#x5927;&amp;#x7684;&amp;#x56E0;&amp;#x7D20;&amp;#xFF0C; &amp;#x5728;&amp;#x68C0;&amp;#x6D4B;&amp;#x65F6;&amp;#x628A;&amp;#x8D1F;&amp;#x6837;&amp;#x672C;&amp;#x66F4;&amp;#x65E9;&amp;#x5730;&amp;#x53BB;&amp;#x9664;&amp;#x63D0;&amp;#x9AD8;&amp;#x4E86;&amp;#x6574;&amp;#x4F53;&amp;#x68C0;&amp;#x6D4B;&amp;#x7684;&amp;#x6548;&amp;#x7387;&amp;#x3002; &amp;#x57FA;&amp;#x4E8E;&amp;#x5F39;&amp;#x6027;&amp;#x4E0D;&amp;#x53D8;&amp;#x6A21;&amp;#x578B;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x9488;&amp;#x5BF9;&amp;#x4EBA;&amp;#x8138;&amp;#x5404;&amp;#x90E8;&amp;#x5206;&amp;#x5C40;&amp;#x90E8;&amp;#x7279;&amp;#x5F81;&amp;#x54CD;&amp;#x5E94;&amp;#x5BFB;&amp;#x627E;&amp;#x56FE;&amp;#x50CF;&amp;#x4E2D;&amp;#x7684;&amp;#x4EBA;&amp;#x8138;&amp;#x3002; &amp;#x57FA;&amp;#x4E8E;&amp;#x795E;&amp;#x7ECF;&amp;#x7F51;&amp;#x7EDC;/&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x7B97;&amp;#x6CD5;&amp;#x81EA;&amp;#x4E3B;&amp;#x5B66;&amp;#x4E60;&amp;#x4EBA;&amp;#x8138;&amp;#x5C40;&amp;#x90E8;&amp;#x53CA;&amp;#x6574;&amp;#x4F53;&amp;#x7279;&amp;#x5F81;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;&quot;&gt;&lt;a href=&quot;#&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;&quot;&gt;&lt;/a&gt;&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;&lt;/h2&gt;&lt;ol&gt;
&lt;li&gt;&lt;span id=&quot;1&quot;&gt; P. Viola, M. Jones. Rapid object detection using a boosted cascade of simple features[C], IEEE Conference on Computer Vision and Pattern Recognition&amp;#xFF0C; 2001&amp;#xFF0C; I-511~I-518 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;2&quot;&gt; P. Viola, M. Jones. Robust real-time face detection[J]. International Journal of Computer Vision, 57(2), 2004, 137-154 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;3&quot;&gt; R. Xiao, L. Zhu, H. Zhang. Boosting Chain Learning for Object Detection[C], IEEE International Conference on Computer Vision, 2003, 709~715 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;4&quot;&gt; R. Lienhart, J. Maydt. An Extended Set of Haar-like Features for Rapid Object Detection[C], IEEE International Conference on Image Processing, 2002, I-900~I-903 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;5&quot;&gt; R. Lienhart, A. Kuranov, V. Pisarevsky. Empirical Analysis of Detection Cascades of Boosted Classifiers for Rapid Object Detection[C], Pattern Recognition, Springer, 2003, 297~304 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;6&quot;&gt; M. Jones, P. Viola. Fast multi-view face detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2003 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;7&quot;&gt; P. F. Felzenszwalb, D. P. Huttenlocher. Pictorial Structures for Object Recognition[J], International Journal of Computer Vision, Vol. 61, No. 1, 2005, 55~79 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;8&quot;&gt; P. F. Felzenszwalb, R. B. Girshick, D. McAllester, D. Ramanan. Object Detection with Discriminatively Trained Part-Based Models[J], IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 32, No. 9, 2010, 1627~1645 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;9&quot;&gt; X. Zhu, D. Ramanan. Face detection, pose estimation, and landmark localization in the wild[C], IEEE Conference on Computer Vision and Pattern Recognition, 2012, 2879~2886 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;10&quot;&gt; X. Shen, Z. Lin, J. Brandt, Y. Wu. Detecting and Aligning Faces by Image Retrieval[C], IEEE Conference on Computer Vision and Pattern Recognition, 2013, 3460~3467 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;11&quot;&gt; H. Li, Z. Lin, J. Brandt, X. Shen, G. Hua. Efficient Boosted Exemplar-based Face Detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2014, 1843~1850 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;12&quot;&gt; A. Krizhevsky, I. Sutskever, G. E. Hinton. ImageNet Classification with Deep Convolutional Neural Networks[C], 2012, 1097~1105 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;13&quot;&gt; S. S. Farfade, M. Saberian, L. Li. Multi-view Face Detection Using Deep Convolutional Neural Networks[C], 5th ACM International Conference on Multimedia Retrieval, 2015, 643~650 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;14&quot;&gt; R. Girshick, J. Donahue, T. Darrell, J. Malik. Rich feature hierarchies for accurate object detection and semantic segmentation[C], IEEE Conference on Computer Vision and Pattern Recognition, 2014, 580~587 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;15&quot;&gt; N. Markus, M. Frljak, I. S. Pandzic, J. Ahlberg and R. Forchheimer. A Method for Object Detection Based on Pixel Intensity Comparisons Organized in Decision Trees[J], arXiv preprint arXiv:1305.4537, 2013 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;16&quot;&gt; L. Shengcai, A. K. Jain, and S. Z. Li. Unconstrained face detection, Technical report, Michigan State University, Dec.2012 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;17&quot;&gt; B. Yang, J. Yan, Z. Lei, S. Z. Li. Aggregate channel features for multi-view face detection[C], IEEE International Joint Conference on Biometrics, 2014, 1~8 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;18&quot;&gt; J. Li, Y. Zhang. Learning SURF Cascade for Fast and Accurate Object Detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2013, 3468~3475 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;19&quot;&gt; H. A. Rowley, S. Baluja, T. Kanade. Neural network-based face detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 1996, 203~208 &lt;/span&gt; &lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;20&quot;&gt; Y. Dauphin, R. Pascanu, C. Gulcehre, K. Cho, S. Ganguli, Y. Bengio. Identifying and attacking the saddle point problem in high-dimensional non-convex optimization[C], Neural Information Processing Systems, 2014, 2933~2941 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;21&quot;&gt; S. Liao, A. K. Jain, S. Z. Li. A Fast and Accurate Unconstrained Face Detector[J], IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 38, No. 2, 2016, 211~223 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;22&quot;&gt; Y. Freund, R. E Schapire. A Decision-Theoretic Generalization of On-Line Learning and an Application to Boosting[J], Journal of computer and system sciences, Vol. 55, No. 1, 1997, 119~139 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;23&quot;&gt; J. Li, T. Wang, Y. Zhang. Face detection using SURF cascade[C], IEEE International Conference on Computer Vision, 2011, 2183~2190 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;24&quot;&gt; L. Bourdev, J. Brandt. Robust Object Detection Via Soft Cascade[C], IEEE Conference on Computer Vision and Pattern Recognition, 2005, 236~243 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;25&quot;&gt; H. Bay, A. Ess, T. Tuytelaars, L. Van Gool. Speeded-Up Robust Features (SURF)[J], Computer Vision and Image Understanding, Vol. 10, No. 3, 2008, 346~359 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;26&quot;&gt; J. Wu, N. Liu, C. Geyer, J. M. Rehg. C4 : A Real-Time Object Detection Framework[J], IEEE Transactions on Image Processing, Vol. 22, No. 10, 2013, 4096~4107 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;27&quot;&gt; T. Ojala, M. Pietik&amp;#xE4;inen, D. Harwood. A comparative study of texture measures with classification based on featured distributions, Pattern Recognition, Vol. 29, No. 1, 1996, 51~59 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;28&quot;&gt; M. Mathias, R. Benenson, M. Pedersoli, L. Van Gool. Face detection without bells and whistles[C], European Conference on Computer Vision, 2014, 720~735 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;29&quot;&gt; P. Doll&amp;#xE1;r1, Z. Tu, P. Perona, S. Belongie. Integral channel features[C], British Machine Vision Conference, 2009, 91.1~91.11 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;30&quot;&gt; N. Dalal, B. Triggs. Histograms of Oriented Gradients for Human Detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2005, 886~893 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;31&quot;&gt; P. Doll&amp;#xE1;r, R. Appel, S. Belongie, P. Perona. Fast Feature Pyramids for Object Detection[J], IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 36, No. 8, 2014, 1532~1545 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;32&quot;&gt; P. Viola, M. Jones. Fast and Robust Classification using Asymmetric AdaBoost and a Detector Cascade[C], Neural Information Processing Systems, 2002, 1311~1318 &lt;/span&gt; &lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;33&quot;&gt; M. Saberian, N. Vasconcelos. Boosting Algorithms for Detector Cascade Learning[J], Journal of Machine Learning Research, Vol. 15, No. 1, 2014, 2569~2605 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;34&quot;&gt; P. Doll&amp;#xE1;r, R. Appel, W. Kienzle. Crosstalk Cascades for Frame-Rate Pedestrian Detection[C], European Conference on Computer Vision, 2012, 645~659 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;35&quot;&gt; S. Ren, X. Cao, Y. Wei, J. Sun. Face Alignment at 3000 FPS via Regressing Local Binary Features[C], IEEE Conference on Computer Vision and Pattern Recognition, 2014, 1685~1692&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;36&quot;&gt; X. Cao, Y. Wei, F. Wen, J. Sun. Face Alignment by Explicit Shape Regression[C], IEEE Conference on Computer Vision and Pattern Recognition, 2012, 2887~2894 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;37&quot;&gt; X. P. Burgos-Artizzu, P. Perona, P. Doll&amp;#xE1;r. Robust face landmark estimation under occlusion[C], IEEE International Conference on Computer Vision, 2012, 1513~1520 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;38&quot;&gt; P. Doll&amp;#xE1;r, P. Welinder, P. Perona. Cascaded Pose Regression[C], IEEE Conference on Computer Vision and Pattern Recognition, 2010, 1078~1085 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;39&quot;&gt; D. Chen, S. Ren, Y. Wei, X. Cao, J. Sun. Joint Cascade Face Detection and Alignment[C], European Conference on Computer Vision, 2014, 109~122 &lt;/span&gt; &lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;40&quot;&gt; G. Ghiasi, C. C. Fowlkes. Occlusion Coherence: Detecting and Localizing Occluded Faces[J], arXiv preprint arXiv:1506.08347, 2015 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;41&quot;&gt; J. Yan, X. Zhang, Z. Lei, S. Z. Li. Face detection by structural models[J], Image and Vision Computing, Vol. 32, No. 10, 2014, 790~799 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;42&quot;&gt; J. Yan, Z. Lei, L. Wen, S. Z. Li. The Fastest Deformable Part Model for Object Detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2014, 2497~2504 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;43&quot;&gt; Y. LeCun, Y. Bengio, G. Hinton. Deep learning[J], Nature, Vol. 521, No. 7553, 2015, 436~444 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;44&quot;&gt; X. Glorot, A. Bordes, Y. Bengio. Deep Sparse Rectifier Neural Networks[J], Journal of Machine Learning Research[J], 2011, 315~323 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;45&quot;&gt; G. E. Hinton, N. Srivastava, A. Krizhevsky, I. Sutskever, R. R. Salakhutdinov. Improving neural networks by preventing co-adaptation of feature detectors[J], arXiv preprint arXiv:1207.0580, 2012 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;46&quot;&gt; R. Vaillant, C. Monrocq, Y. Le Cun. An original approach for the localization of objects in images[C], IEEE International Conference on Articial Neural Networks, 1993, 26~30 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;47&quot;&gt; R. Vaillant, C. Monrocq, Y. Le Cun. Original approach for the localisation of objects in images[J], Vision, Image and Signal Processing, Vol. 141, No. 4, 1994, 245~250 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;48&quot;&gt; H. A. Rowley, S. Baluja, T. Kanade. Neural network-based face detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 1996, 203~208 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;49&quot;&gt; C. Garcia, M. Delakis. A Neural Architecture for Fast and Robust Face Detection[C], IEEE International Conference on Pattern Recognition, 2002, 44~47 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;50&quot;&gt; M. Delakis, C. Garcia. Training Convolutional Filters for Robust Face Detection[C], IEEE International Workshop of Neural Networks for Signal Processing, 2003, 739~748 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;51&quot;&gt; C. Garcia, M. Delakis. Convolutional face finder: a neural architecture for fast and robust face detection[J], IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 26, No. 11, 2004, 1408~1423 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;52&quot;&gt; S. Roux, F. Mamalet, C. Garcia. Embedded Convolutional Face Finder[C], IEEE International Conference on Multimedia and Expo, 2006, 285~288 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;53&quot;&gt; M. Osadchy, Y. Le Cun, M. L. Miller. Synergistic Face Detection and Pose Estimation with Energy-Based Models[J], Journal of Machine Learning Research, Vol. 8, No. 1, 2007, 1017~1024 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;54&quot;&gt; B. Yang, J. Yan, Z. Lei, S. Z. Li. Convolutional channel features[C], IEEE International Conference on Computer Vision, 2015, 82~90 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;55&quot;&gt; H. Li, Z. Lin, X. Shen, J. Brandt, G. Hua. A convolutional neural network cascade for face detection[C], IEEE Conference on Computer Vision and Pattern Recognition, 2015, 5325~5334 &lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span id=&quot;56&quot;&gt; S. Yang, P. Luo, C. C. Loy, X. Tang. From facial parts responses to face detection: A deep learning approach[C], IEEE International Conference on Computer Vision, 2015, 3676~3684 &lt;/span&gt;&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;&amp;#x81EA; 2001 &amp;#x5E74; Viola &amp;#x548C; Jones &lt;a href=&quot;#1&quot;&gt;[1]&lt;/a&gt; &amp;#x5C06;&amp;#x7EA7;&amp;#x8054;&amp;#x5206;&amp;#x7C7B;&amp;#x5668;&amp;#x7684;&amp;#x6982;&amp;#x5FF5;
    
    </summary>
    
      <category term="face detection" scheme="http://deyituo.github.io/categories/face-detection/"/>
    
    
      <category term="face detection" scheme="http://deyituo.github.io/tags/face-detection/"/>
    
      <category term="AI" scheme="http://deyituo.github.io/tags/AI/"/>
    
  </entry>
  
</feed>
